{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
          "hallo", "hai", "halo", "hei", "hi", "pagi", "siang", "malam", "selamat pagi", "selamat siang", "selamat malam",
                "apa kabar?", "bagaimana kabarmu?", "halo apa kabar?", "hi, apa yang bisa kamu lakukan?", "halo, selamat datang",
                "hai, apa ada yang bisa dibantu?", "halo, saya butuh bantuan", "halo bot", "hai bot", "halo PLN", "hai PLN",
                "halo, ada informasi?", "hi, ada layanan apa?", "halo layanan PLN", "halo, layanan listrik apa saja?", "hai, bisakah kamu membantu?",
                "selamat pagi bot", "selamat siang bot", "selamat malam bot", "pagi PLN", "siang PLN", "malam PLN",
                "apa kabar bot?", "halo, apa ini PLN?", "halo PLN bot", "hai PLN bot", "halo, bisakah kamu menjelaskan layanan PLN?",
                "halo, ini layanan PLN?", "hai, apa kabar PLN?", "selamat datang PLN", "halo layanan PLN, ada yang bisa saya bantu?", "hi, saya ada pertanyaan",
                "halo, bisa bantu soal listrik?", "hai, butuh info soal PLN", "hi bot PLN", "halo bot PLN", "halo layanan PLN apa kabar?",
                "apa saja yang kamu bisa bantu?", "halo bot listrik", "hi layanan PLN", "hai layanan listrik", "halo PLN online",
                "hai PLN digital", "halo chatbot PLN", "selamat datang layanan PLN", "halo saya ingin info listrik", "hi apa PLN bisa bantu?",
                "hai layanan PLN digital"
        ],
        "responses": [
    "Halo! Apa yang bisa saya bantu hari ini? 😊",
    "Hai! Selamat datang, ada yang bisa saya bantu?",
    "Selamat pagi! Apa yang bisa saya bantu hari ini?",
    "Selamat siang! Ada informasi yang bisa saya bantu?",
    "Selamat malam! Ada yang bisa saya bantu mengenai layanan PLN?",
    "Halo! Apa kabar? Saya siap membantu Anda dengan informasi tentang layanan PLN.",
    "Hai! Saya di sini untuk membantu Anda mengenai listrik dan layanan PLN. Ada yang bisa saya bantu?",
    "Selamat datang! Ada pertanyaan seputar layanan listrik atau tagihan PLN?",
    "Halo, saya chatbot PLN. Ada yang ingin Anda ketahui tentang layanan PLN?",
    "Hai, ada informasi atau bantuan mengenai listrik yang Anda butuhkan?",
    "Halo! Jika ada pertanyaan tentang layanan PLN atau tagihan listrik, saya siap membantu.",
    "Selamat pagi! Jika ada yang perlu ditanyakan tentang listrik atau PLN, saya ada di sini.",
    "Halo, saya chatbot PLN. Apa yang bisa saya bantu untuk Anda hari ini?",
    "Hi! Apakah Anda membutuhkan informasi tentang tagihan listrik atau layanan PLN?",
    "Selamat datang! Ada layanan PLN yang bisa saya bantu jelaskan?",
    "Hai! Jika Anda butuh bantuan mengenai listrik atau tagihan PLN, saya siap membantu.",
    "Halo PLN! Ada yang bisa saya bantu terkait layanan listrik?",
    "Hai! Apakah Anda ingin tahu lebih banyak tentang layanan PLN digital?",
    "Halo! Saya di sini untuk memberikan informasi tentang listrik dan layanan PLN. Apa yang bisa saya bantu?",
    "Selamat datang! Jika ada pertanyaan mengenai layanan listrik PLN, saya siap membantu.",
    "Hai PLN! Ada yang bisa saya bantu terkait tagihan atau informasi listrik?",
    "Halo, ada yang perlu saya bantu terkait layanan PLN atau tagihan listrik?"
        ]
      },
      {
        "tag": "penjelasan_pln",
        "patterns": [
          "Apa itu PLN?", "Jelaskan tentang PLN", "Apa fungsi PLN?", "PLN itu apa?", "Apa tugas PLN?",
                "Apa peran PLN di Indonesia?", "Apa kepanjangan PLN?", "Apa yang dilakukan oleh PLN?", "Bisakah kamu jelaskan tentang PLN?", "Informasi tentang PLN?",
                "PLN singkatan dari apa?", "Apa yang dikerjakan PLN?", "Apa PLN itu perusahaan?", "PLN bergerak di bidang apa?", "Tolong jelaskan PLN itu apa?",
                "Fungsi utama PLN apa?", "PLN adalah apa?", "Informasi singkat tentang PLN?", "Apa yang dimaksud dengan PLN?", "PLN, tolong jelaskan?",
                "PLN itu untuk apa?", "Apakah PLN hanya di Indonesia?", "Apa layanan utama PLN?", "PLN itu swasta atau negara?", "Bagaimana PLN beroperasi?",
                "Apakah PLN itu pemerintah?", "PLN itu milik siapa?", "Apa tujuan PLN didirikan?", "PLN singkatan dan artinya?", "Jelaskan peran PLN di masyarakat?",
                "PLN apa saja layanannya?", "Apakah PLN mengurus semua listrik?", "PLN itu tanggung jawab siapa?", "Mengapa PLN penting?", "Apa misi PLN?",
                "Visi misi PLN apa?", "PLN apa layanan utamanya?", "PLN fokusnya apa?", "PLN itu punya siapa?", "PLN itu apa sih?",
                "Tolong beri informasi PLN", "Peran PLN di kehidupan masyarakat apa?", "PLN itu instansi apa?", "PLN itu swasta atau negeri?", "Apa spesialisasi PLN?",
                "Apa yang PLN kerjakan?", "PLN itu tentang apa?", "Jelaskan fungsi PLN di Indonesia?", "PLN itu institusi atau perusahaan?", "PLN urus apa saja?",
                "Apa kontribusi PLN?", "Sejak kapan ada PLN?", "PLN sudah ada sejak kapan?", "Apa PLN itu resmi?", "Apa PLN bertanggung jawab pada semua listrik?",
                "Apa PLN itu badan usaha?", "Bagaimana PLN mengelola listrik?", "Apa kerja PLN?", "Apa tujuan utama PLN?", "PLN dan tugasnya apa?"
        ],
        "responses": [
          "PLN (Perusahaan Listrik Negara) adalah perusahaan milik negara yang mengelola dan menyediakan listrik untuk seluruh wilayah Indonesia. PLN bertanggung jawab untuk memastikan pasokan listrik yang cukup dan merata bagi seluruh masyarakat.",
    "PLN adalah badan usaha milik negara (BUMN) yang memiliki tugas utama untuk menyediakan layanan kelistrikan kepada masyarakat di Indonesia, termasuk distribusi, transmisi, dan pembangkitan listrik.",
    "Fungsi utama PLN adalah menyediakan layanan kelistrikan yang aman, cukup, dan terjangkau bagi seluruh masyarakat Indonesia. PLN bertugas mengelola pembangkit listrik, transmisi, serta distribusi listrik ke konsumen.",
    "PLN atau Perusahaan Listrik Negara adalah perusahaan milik negara yang bertanggung jawab atas penyediaan, distribusi, dan pembangkitan listrik di Indonesia.",
    "PLN adalah lembaga yang bertanggung jawab atas pasokan listrik di Indonesia. Tugas PLN meliputi penyediaan pembangkit listrik, distribusi energi, serta memastikan listrik tersedia dengan kualitas yang baik dan merata.",
    "PLN merupakan perusahaan negara yang memiliki tanggung jawab besar untuk memenuhi kebutuhan listrik di seluruh Indonesia, dari pembangkit listrik, transmisi, hingga distribusi ke pelanggan.",
    "PLN didirikan dengan tujuan untuk mengelola dan menyediakan listrik bagi seluruh wilayah Indonesia. PLN beroperasi di bawah pengawasan pemerintah dan bertugas memastikan semua masyarakat mendapatkan akses ke listrik.",
    "PLN adalah perusahaan yang bergerak di bidang kelistrikan, yang mencakup pembangkitan, distribusi, dan transmisi listrik. Sebagai BUMN, PLN bertugas menyediakan listrik dengan harga yang wajar bagi masyarakat.",
    "PLN adalah perusahaan milik negara yang memiliki tugas utama untuk menyediakan dan mengelola kelistrikan di Indonesia. PLN beroperasi sebagai badan usaha yang melayani kebutuhan energi listrik untuk rumah tangga, industri, dan sektor lainnya.",
    "PLN berperan penting dalam kehidupan masyarakat Indonesia dengan memastikan ketersediaan listrik yang dibutuhkan untuk kehidupan sehari-hari, serta untuk mendukung sektor ekonomi dan industri.",
    "PLN adalah perusahaan yang memiliki misi untuk menyediakan energi listrik yang dapat diandalkan untuk masyarakat Indonesia. PLN memiliki visi untuk menjadi perusahaan kelistrikan yang terdepan dalam inovasi dan kualitas pelayanan.",
    "PLN adalah perusahaan yang sepenuhnya dimiliki oleh negara dan bertanggung jawab dalam mengelola seluruh infrastruktur kelistrikan di Indonesia, termasuk pembangkit, distribusi, dan transmisi listrik.",
    "Sebagai badan usaha milik negara, PLN bertugas untuk mengatur, mengelola, dan mendistribusikan listrik di Indonesia. PLN memastikan listrik tersedia di seluruh pelosok negeri, mendukung pertumbuhan ekonomi dan kualitas hidup masyarakat.",
    "PLN bertanggung jawab untuk menyuplai listrik bagi seluruh masyarakat Indonesia. Tugas utamanya adalah memastikan ketersediaan dan kelancaran pasokan listrik yang cukup untuk kebutuhan sehari-hari.",
    "Peran PLN sangat penting dalam kehidupan masyarakat karena tanpa listrik, hampir semua sektor kehidupan, seperti pendidikan, industri, kesehatan, dan layanan publik, akan terganggu. PLN memastikan listrik tersedia dengan kualitas yang baik dan stabil.",
    "PLN adalah lembaga negara yang mengelola sistem kelistrikan di Indonesia, mulai dari pembangkit hingga distribusi listrik ke rumah tangga dan industri. PLN menyediakan energi listrik yang mendukung kemajuan sosial dan ekonomi negara.",
    "PLN memiliki visi untuk menjadi perusahaan energi terdepan di Indonesia dan berfokus pada keberlanjutan serta inovasi dalam pengelolaan kelistrikan di negara ini.",
    "PLN juga berperan dalam mendorong perkembangan teknologi energi terbarukan dan memastikan bahwa sumber daya listrik di Indonesia dapat dikelola dengan baik untuk keberlanjutan masa depan.",
    "PLN adalah badan usaha yang dikelola oleh negara dengan tujuan untuk menyediakan listrik bagi seluruh rakyat Indonesia. PLN berperan dalam mendukung kemajuan ekonomi dan kehidupan masyarakat dengan menyuplai listrik yang merata dan aman.",
    "PLN adalah lembaga yang diatur oleh pemerintah untuk menyediakan kelistrikan kepada seluruh rakyat Indonesia. Tujuan utama PLN adalah agar setiap rumah tangga dan sektor industri dapat memperoleh akses listrik dengan harga yang wajar."
        ]
      },
      {
        "tag": "layanan_pln",
        "patterns": [
          "Layanan apa saja yang disediakan oleh PLN?", "Apa saja layanan PLN?", "PLN menyediakan layanan apa?", "Jelaskan layanan PLN.", "Layanan dari PLN apa saja?",
                "Apa layanan utama PLN?", "Layanan PLN itu apa?", "PLN ada layanan apa saja?", "Layanan apa yang bisa saya dapatkan dari PLN?", "Informasi layanan PLN?",
                "PLN memberikan layanan apa?", "Apa PLN punya layanan pelanggan?", "Bagaimana layanan PLN?", "Apa PLN melayani pemasangan baru?", "Apa PLN melayani gangguan?",
                "PLN melayani pembayaran apa saja?", "PLN bisa apa saja?", "Apa yang bisa dilakukan PLN?", "Layanan PLN selain listrik apa?", "Apa PLN punya aplikasi?",
                "PLN menyediakan apa saja?", "Apa PLN punya layanan aplikasi?", "Apa PLN punya hotline?", "Apa PLN punya pusat layanan?", "PLN bantu pelanggan dengan apa?",
                "PLN ada layanan khusus apa?", "Apa saja layanan PLN terbaru?", "Apa PLN punya layanan online?", "Apa PLN bisa bantu soal tagihan?", "PLN melayani apa saja?",
                "Layanan digital PLN apa?", "Layanan fisik PLN apa saja?", "Bagaimana layanan PLN saat ini?", "PLN bisa dihubungi lewat mana?", "Ada layanan instalasi baru di PLN?",
                "Apa PLN punya layanan informasi?", "PLN punya program apa saja?", "PLN ada layanan konsultasi?", "Layanan PLN apa untuk masyarakat?", "Apa PLN punya layanan gangguan listrik?",
                "PLN punya layanan pelaporan apa?", "PLN dan layanan pelanggannya bagaimana?", "Apa saja program dan layanan PLN?", "Apa PLN punya layanan aplikasi digital?", "PLN bantu soal meteran bagaimana?",
                "PLN ada layanan untuk bisnis apa?", "Layanan pelanggan PLN itu apa saja?", "Layanan pelanggan PLN bagaimana?", "PLN melayani perbaikan listrik?", "PLN ada layanan khusus rumah tangga?",
                "Apa PLN bantu soal gangguan jaringan?", "Apa PLN melayani permohonan subsidi?", "PLN punya layanan darurat?", "Apa layanan terbaru dari PLN?", "PLN membantu dalam pembayaran tagihan bagaimana?"
        ],
        "responses": [
          "PLN menyediakan berbagai layanan termasuk pasokan listrik, pemasangan baru, perbaikan gangguan listrik, dan layanan pelanggan. Anda juga bisa memanfaatkan layanan online PLN untuk memeriksa tagihan dan melakukan pembayaran.",
    "Layanan utama PLN mencakup penyediaan listrik untuk rumah tangga dan bisnis, pemasangan sambungan listrik baru, serta layanan penanganan gangguan listrik. PLN juga menyediakan aplikasi digital yang memudahkan pelanggan dalam mengakses informasi dan melakukan pembayaran.",
    "PLN menyediakan beberapa layanan utama seperti penyediaan listrik, pemasangan listrik baru, penanganan gangguan listrik, layanan pembayaran tagihan, serta pusat layanan pelanggan. PLN juga menawarkan layanan digital melalui aplikasi PLN Mobile.",
    "Beberapa layanan yang disediakan PLN antara lain pemasangan listrik baru, layanan gangguan, pemeliharaan instalasi listrik, serta layanan tagihan. PLN juga memiliki hotline dan pusat layanan untuk membantu pelanggan dalam kebutuhan listrik.",
    "PLN memiliki layanan pelanggan yang dapat diakses melalui berbagai kanal, seperti aplikasi PLN Mobile, hotline, dan pusat layanan di berbagai lokasi. Layanan pelanggan mencakup konsultasi, pembayaran tagihan, serta bantuan terkait gangguan listrik.",
    "Layanan PLN tidak hanya mencakup listrik, tetapi juga pelayanan terkait pemasangan baru, penanganan gangguan, serta layanan pelanggan yang meliputi pembayaran tagihan dan pemeliharaan listrik.",
    "PLN memberikan layanan pemeliharaan dan perbaikan instalasi listrik, pemasangan sambungan baru, serta penanganan gangguan. Selain itu, PLN juga menyediakan layanan pembayaran tagihan listrik baik secara fisik maupun online melalui aplikasi.",
    "Untuk memenuhi kebutuhan pelanggan, PLN menyediakan aplikasi PLN Mobile yang memungkinkan Anda untuk mengecek tagihan, melakukan pembayaran, serta melaporkan gangguan listrik dengan mudah.",
    "PLN juga memiliki layanan darurat untuk menangani gangguan listrik yang terjadi secara mendadak. Pelanggan bisa menghubungi hotline PLN atau menggunakan aplikasi PLN Mobile untuk melaporkan gangguan.",
    "Layanan digital PLN termasuk aplikasi PLN Mobile yang memungkinkan pelanggan untuk memantau tagihan, melakukan pembayaran secara online, serta melaporkan gangguan listrik. Anda juga dapat mengakses berbagai informasi tentang kelistrikan melalui aplikasi ini.",
    "Selain layanan kelistrikan utama, PLN juga menawarkan layanan konsultasi terkait penggunaan listrik efisien serta pemeliharaan instalasi listrik. Kami juga memiliki program subsidi untuk pelanggan yang memenuhi syarat.",
    "PLN melayani pemasangan baru bagi pelanggan yang membutuhkan sambungan listrik ke rumah atau bisnis. Proses pemasangan dapat dilakukan secara online melalui aplikasi PLN atau dengan mengunjungi pusat layanan terdekat.",
    "PLN memiliki berbagai program untuk membantu masyarakat, termasuk program subsidi listrik bagi pelanggan berpendapatan rendah, serta berbagai inisiatif penghematan energi dan penggunaan energi terbarukan.",
    "Untuk bisnis, PLN menyediakan layanan khusus seperti pemasangan sambungan listrik industri, penanganan gangguan listrik, dan konsultasi mengenai penggunaan listrik yang lebih efisien.",
    "PLN memiliki berbagai layanan untuk mendukung pelanggan dalam hal pemeliharaan listrik dan gangguan listrik. Jika ada masalah dengan jaringan listrik, pelanggan dapat menghubungi PLN melalui aplikasi atau hotline untuk melaporkan dan meminta bantuan.",
    "Layanan terbaru PLN termasuk pengembangan platform digital, aplikasi PLN Mobile yang semakin memudahkan pelanggan dalam mengakses layanan, serta layanan berbasis teknologi untuk meningkatkan kualitas dan efisiensi penyediaan listrik.",
    "PLN juga memberikan layanan pelaporan gangguan listrik melalui aplikasi PLN Mobile, hotline, dan pusat layanan pelanggan. Anda dapat melaporkan gangguan secara langsung dan mendapatkan informasi mengenai status pemulihan.",
    "Selain layanan fisik, PLN juga menyediakan layanan pelanggan berbasis digital yang dapat diakses melalui aplikasi dan website untuk kemudahan pelanggan dalam mengelola tagihan dan permintaan terkait kelistrikan.",
    "Layanan PLN untuk masyarakat mencakup penyediaan listrik yang andal, pemeliharaan, dan perbaikan instalasi listrik, serta layanan pelanggan yang tersedia secara fisik maupun digital melalui aplikasi.",
    "Jika Anda mengalami gangguan listrik, PLN memiliki layanan penanganan gangguan yang bisa diakses melalui aplikasi, hotline, atau langsung mengunjungi pusat layanan. Kami memastikan gangguan dapat ditangani dengan cepat dan tepat.",
    "Untuk pelanggan rumah tangga, PLN menyediakan layanan pembelian token listrik prabayar, pembayaran tagihan, serta akses mudah untuk melaporkan gangguan atau keluhan melalui aplikasi PLN Mobile."
        ]
      },
      {
        "tag": "tagihan_listrik",
        "patterns": [
        "Bagaimana cara mengecek tagihan listrik?", "Berapa tagihan listrik saya bulan ini?", "Bagaimana cek tagihan listrik?", "Cara mengetahui tagihan listrik bagaimana?", "Tagihan listrik bisa dicek di mana?",
        "Bagaimana cek tagihan listrik di PLN?", "Tagihan listrik saya berapa?", "Tagihan listrik ini di mana dicek?", "Cara melihat tagihan PLN?", "Bagaimana PLN mengecek tagihan?",
        "Tagihan listrik bulan ini bagaimana cara tahu?", "Apakah ada cara untuk cek tagihan listrik?", "Tagihan PLN bisa dicek di mana?", "Bagaimana cara tahu tagihan listrik online?", "Cara cek tagihan PLN lewat aplikasi bagaimana?",
        "Tagihan listrik bisa dicek lewat apa?", "Bagaimana saya tahu tagihan listrik?", "PLN punya cara cek tagihan?", "Cek tagihan listrik bulanan di mana?", "PLN membantu cek tagihan bagaimana?",
         "Cek tagihan lewat PLN Mobile bagaimana?", "Cek tagihan lewat aplikasi apa?", "Bagaimana cek tagihan dengan ID pelanggan?", "Dimana mengecek rincian tagihan listrik?", "Cara mudah cek tagihan listrik?",
        "Tagihan listrik bulan lalu bisa dicek?", "Apa langkah untuk cek tagihan listrik?", "Apakah tagihan listrik bisa dicek di HP?", "Cara mengetahui tagihan PLN dengan cepat?", "Cek tagihan listrik online bagaimana caranya?",
         "Bagaimana cara cek tagihan listrik tanpa ke kantor?", "Apa website resmi untuk cek tagihan PLN?", "Bagaimana menggunakan PLN Mobile untuk cek tagihan?", "Cek tagihan PLN via internet bagaimana?", "Aplikasi apa yang digunakan untuk cek tagihan PLN?",
         "Bagaimana cara cek tagihan listrik lewat SMS?", "Cek tagihan PLN dengan nomor meter bagaimana?", "Bisakah tagihan listrik dicek di ATM?", "Langkah untuk cek tagihan PLN lewat email?", "Bagaimana melihat detail tagihan listrik PLN?",
         "Cek tagihan listrik lewat WhatsApp bagaimana?", "Tagihan listrik rumah saya berapa sekarang?", "Cara memeriksa tagihan PLN dengan nomor rekening?", "Apakah ada fitur online untuk cek tagihan listrik?", "Bagaimana cara mengetahui jumlah tagihan listrik bulan ini?"
        ],
        "responses": [
          "Untuk mengecek tagihan listrik Anda, Anda bisa menggunakan berbagai cara, antara lain melalui aplikasi PLN Mobile, website resmi PLN, atau SMS. Anda juga bisa memeriksa rincian tagihan melalui ID pelanggan.",
    "Tagihan listrik Anda bulan ini dapat dicek melalui aplikasi PLN Mobile, dengan menggunakan ID pelanggan atau nomor meter Anda. Anda juga dapat mengunjungi website resmi PLN untuk melihat tagihan secara online.",
    "Cara mudah untuk mengecek tagihan listrik adalah dengan mengakses aplikasi PLN Mobile atau mengunjungi situs web resmi PLN. Anda bisa memasukkan nomor ID pelanggan atau nomor meter untuk melihat tagihan lengkap.",
    "Anda bisa mengecek tagihan listrik melalui aplikasi PLN Mobile yang tersedia di smartphone. Masukkan ID pelanggan atau nomor meter Anda untuk melihat rincian tagihan dengan mudah.",
    "Tagihan listrik bulan lalu bisa dicek melalui aplikasi PLN Mobile atau website PLN. Anda bisa melihat rincian tagihan dengan menggunakan ID pelanggan atau nomor meter.",
    "Untuk mengetahui tagihan listrik PLN, Anda bisa menggunakan aplikasi PLN Mobile, mengakses website PLN, atau menghubungi layanan pelanggan PLN. Semua informasi tagihan tersedia secara online.",
    "PLN menyediakan cara mudah untuk mengecek tagihan listrik melalui aplikasi PLN Mobile, website resmi PLN, atau melalui SMS. Anda hanya perlu memasukkan ID pelanggan atau nomor meter.",
    "Anda bisa mengecek tagihan listrik dengan cepat menggunakan aplikasi PLN Mobile atau website PLN. Anda hanya perlu memasukkan ID pelanggan untuk melihat jumlah tagihan dan rincian lainnya.",
    "Jika Anda ingin mengetahui tagihan listrik tanpa pergi ke kantor, Anda bisa mengecek tagihan melalui aplikasi PLN Mobile atau melalui website PLN secara online.",
    "Anda dapat menggunakan website resmi PLN untuk mengecek tagihan listrik dengan memasukkan ID pelanggan atau nomor meter. Anda juga bisa menggunakan aplikasi PLN Mobile untuk mempermudah proses ini.",
    "Cek tagihan listrik PLN bisa dilakukan lewat aplikasi PLN Mobile yang tersedia di Android dan iOS. Anda bisa mengecek tagihan kapan saja dan di mana saja dengan memasukkan ID pelanggan.",
    "PLN juga menyediakan cara untuk mengecek tagihan melalui SMS. Anda bisa mengirimkan SMS dengan format yang telah ditentukan ke nomor resmi PLN untuk mendapatkan informasi tagihan.",
    "Anda dapat menggunakan nomor meter atau ID pelanggan untuk mengecek tagihan listrik melalui aplikasi PLN Mobile atau website PLN. Cukup masukkan informasi tersebut untuk melihat rincian tagihan.",
    "Untuk mengecek tagihan lewat WhatsApp, Anda bisa menghubungi nomor layanan pelanggan PLN dan mengikuti instruksi untuk melihat tagihan listrik Anda. Anda akan diminta untuk memasukkan ID pelanggan.",
    "Cek tagihan listrik melalui SMS adalah pilihan praktis. Anda hanya perlu mengirimkan SMS dengan format yang sesuai ke nomor PLN untuk mengetahui tagihan listrik Anda.",
    "PLN Mobile adalah aplikasi yang dapat Anda gunakan untuk mengecek tagihan listrik dengan cepat. Anda cukup memasukkan ID pelanggan atau nomor meter untuk melihat detail tagihan listrik.",
    "Selain menggunakan aplikasi dan website PLN, Anda juga bisa mengecek tagihan melalui email dengan mengikuti langkah-langkah yang disediakan oleh PLN. Cek inbox email untuk mendapatkan rincian tagihan."
        ]
      },
      {
        "tag": "cara_bayar_tagihan",
        "patterns": [
          "Bagaimana cara membayar tagihan listrik?", 
    "Apa saja cara pembayaran tagihan listrik?", 
    "Cara bayar tagihan PLN bagaimana?", 
    "Bagaimana cara bayar tagihan listrik online?", 
    "Tagihan listrik dibayar lewat apa saja?",
    "Apakah ada aplikasi untuk membayar tagihan listrik?", 
    "Bayar tagihan listrik di mana?", 
    "Langkah-langkah membayar tagihan listrik bagaimana?", 
    "Cara membayar tagihan listrik lewat ATM?", 
    "Bagaimana cara membayar tagihan PLN di aplikasi?", 
    "Apakah bisa bayar tagihan listrik lewat e-wallet?", 
    "Bagaimana cara bayar tagihan PLN di minimarket?", 
    "Bayar tagihan PLN di Indomaret atau Alfamart bagaimana?", 
    "Metode pembayaran listrik apa saja yang tersedia?", 
    "Apa opsi pembayaran untuk tagihan listrik?", 
    "Bagaimana cara bayar tagihan listrik lewat aplikasi PLN Mobile?", 
    "Bayar listrik lewat internet banking bagaimana?", 
    "Cara pembayaran tagihan PLN melalui mobile banking?", 
    "Bisakah membayar tagihan listrik dengan kartu kredit?", 
    "Apakah bisa bayar listrik melalui dompet digital seperti OVO atau GoPay?", 
    "Bagaimana cara membayar tagihan listrik secara tunai?", 
    "Langkah bayar listrik online bagaimana caranya?", 
    "Bagaimana cara membayar tagihan listrik lewat ShopeePay?", 
    "Apakah tagihan listrik bisa dibayar di Tokopedia?", 
    "Bayar tagihan PLN lewat Lazada atau Bukalapak bagaimana?", 
    "Apa saja bank yang mendukung pembayaran tagihan listrik?", 
    "Bagaimana cara bayar listrik via transfer bank?", 
    "Bisakah bayar listrik dengan QRIS?", 
    "Cara mudah bayar tagihan listrik tanpa antre?", 
    "Bagaimana proses pembayaran tagihan listrik lewat PayPal?", 
    "Bisakah saya membayar tagihan listrik untuk orang lain?", 
    "Bagaimana cara membayar tagihan listrik secara otomatis?", 
    "Apakah PLN menyediakan sistem auto-debit?", 
    "Cara bayar listrik lewat SMS banking bagaimana?", 
    "Bagaimana cara membayar tagihan listrik pascabayar?", 
    "Dimana saya bisa membayar tagihan listrik secara offline?", 
    "Bayar tagihan listrik lewat kantor pos bagaimana?", 
    "Bagaimana cara menggunakan kode bayar listrik?", 
    "Cara bayar tagihan listrik dengan virtual account bagaimana?", 
    "Bayar tagihan PLN via DANA bagaimana?"
        ],
        "responses": [
          "Untuk membayar tagihan listrik, Anda dapat menggunakan berbagai metode, seperti melalui aplikasi PLN Mobile, transfer bank, ATM, minimarket, atau dompet digital. Anda juga bisa membayar tagihan listrik di tempat pembayaran seperti Indomaret, Alfamart, atau kantor pos.",
    "Pembayaran tagihan listrik bisa dilakukan melalui berbagai saluran, baik online maupun offline. Anda dapat menggunakan aplikasi PLN Mobile, transfer bank, internet banking, e-wallet seperti GoPay, OVO, DANA, atau melakukan pembayaran langsung di minimarket terdekat.",
    "Anda bisa membayar tagihan listrik secara online menggunakan aplikasi PLN Mobile. Cukup login dengan ID pelanggan, pilih tagihan yang ingin dibayar, dan lakukan pembayaran menggunakan metode pilihan Anda.",
    "Jika Anda ingin membayar tagihan listrik menggunakan ATM, pilih menu 'Pembayaran', kemudian pilih 'Tagihan Listrik' atau 'PLN', masukkan nomor ID pelanggan, dan bayar sesuai nominal yang tertera.",
    "Pembayaran tagihan listrik bisa dilakukan melalui beberapa metode, seperti menggunakan aplikasi PLN Mobile, transfer bank, atau langsung di minimarket seperti Indomaret dan Alfamart. Anda juga dapat memanfaatkan layanan mobile banking atau internet banking dari bank-bank besar.",
    "Untuk membayar tagihan listrik melalui e-wallet, Anda dapat menggunakan aplikasi seperti GoPay, OVO, atau DANA. Pilih layanan pembayaran tagihan dan masukkan ID pelanggan PLN Anda untuk menyelesaikan pembayaran.",
    "Anda bisa membayar tagihan PLN di minimarket seperti Indomaret atau Alfamart. Cukup bawa ID pelanggan PLN Anda, dan kasir akan membantu Anda melakukan pembayaran.",
    "Selain pembayaran secara online, tagihan listrik juga bisa dibayar di kantor pos atau menggunakan SMS banking dari bank tertentu. Pastikan Anda memiliki nomor ID pelanggan PLN yang valid.",
    "Jika Anda ingin membayar tagihan listrik melalui mobile banking atau internet banking, pilih menu 'Pembayaran', kemudian pilih 'PLN' atau 'Tagihan Listrik', masukkan ID pelanggan PLN, dan konfirmasi pembayaran.",
    "Bayar tagihan listrik menggunakan QRIS dapat dilakukan melalui aplikasi dompet digital seperti GoPay, OVO, DANA, atau aplikasi perbankan yang sudah mendukung QRIS. Cukup scan QR code yang diberikan di aplikasi PLN atau tempat pembayaran.",
    "Untuk pembayaran otomatis, Anda bisa mendaftar layanan auto-debit PLN dengan bank yang bekerja sama. Ini memungkinkan tagihan listrik Anda dibayar secara otomatis setiap bulan.",
    "Apabila Anda ingin membayar tagihan untuk orang lain, Anda dapat melakukannya melalui aplikasi PLN Mobile, mobile banking, atau minimarket. Cukup masukkan ID pelanggan yang bersangkutan untuk melakukan pembayaran.",
    "Untuk membayar tagihan listrik pascabayar, Anda dapat menggunakan aplikasi PLN Mobile atau melalui kanal pembayaran lainnya seperti transfer bank atau minimarket. Pastikan Anda memeriksa jumlah tagihan terlebih dahulu.",
    "Kode bayar listrik dapat digunakan untuk mempermudah pembayaran. Anda bisa mendapatkannya di aplikasi PLN Mobile atau SMS dan gunakan kode tersebut di aplikasi atau di tempat pembayaran untuk menyelesaikan transaksi.",
    "Pembayaran tagihan PLN melalui ShopeePay bisa dilakukan dengan memilih menu 'Pembayaran' di aplikasi Shopee, kemudian pilih 'Listrik' dan masukkan ID pelanggan PLN Anda untuk melanjutkan pembayaran."
        ]
      },
      {
        "tag": "sambungan_baru",
        "patterns": [
          "Bagaimana cara mendaftar untuk sambungan listrik baru?",
    "Prosedur untuk pemasangan listrik baru seperti apa?",
    "Apa syarat untuk pemasangan sambungan listrik baru?",
    "Bagaimana cara mengajukan permohonan sambungan listrik baru?",
    "Apa langkah-langkah untuk pemasangan listrik baru?",
    "Cara mendaftar sambungan listrik baru, bagaimana?",
    "Apa dokumen yang dibutuhkan untuk pemasangan listrik baru?",
    "Berapa lama waktu yang dibutuhkan untuk pemasangan listrik baru?",
    "Bagaimana cara mengurus pemasangan sambungan listrik baru?",
    "Pemasangan listrik baru bisa dilakukan di mana?",
    "Apakah ada biaya untuk pemasangan sambungan listrik baru?",
    "Prosedur pemasangan sambungan listrik PLN bagaimana?",
    "Apa saja persyaratan untuk mengajukan sambungan listrik baru?",
    "Di mana saya bisa mendaftar untuk pemasangan sambungan listrik baru?",
    "Apa yang perlu disiapkan untuk pemasangan sambungan listrik baru?",
    "Bagaimana cara mendaftar sambungan listrik baru secara online?"
        ],
        "responses": [
          "Untuk mendaftar sambungan listrik baru, Anda perlu mengunjungi kantor PLN terdekat atau menggunakan layanan online PLN. Anda akan diminta untuk mengisi formulir permohonan dan melengkapi dokumen persyaratan seperti fotokopi KTP dan surat permohonan sambungan baru.",
    "Prosedur pemasangan listrik baru dimulai dengan pengajuan permohonan melalui aplikasi PLN Mobile atau langsung di kantor PLN. Anda harus mengisi formulir dan melampirkan dokumen yang diperlukan, lalu menunggu konfirmasi dari PLN mengenai jadwal pemasangan.",
    "Syarat untuk pemasangan sambungan listrik baru antara lain fotokopi KTP, surat permohonan pemasangan sambungan, serta lokasi yang sudah memenuhi standar teknis untuk pemasangan jaringan listrik.",
    "Untuk mengajukan permohonan sambungan listrik baru, Anda bisa mengunjungi kantor PLN atau menggunakan aplikasi PLN Mobile untuk pengajuan secara online. Setelah itu, PLN akan melakukan verifikasi dan pemasangan sambungan sesuai dengan jadwal yang ditentukan.",
    "Langkah-langkah pemasangan listrik baru dimulai dengan pengajuan permohonan, lalu verifikasi oleh petugas PLN, pemasangan jaringan listrik, dan akhirnya pemeriksaan serta penyambungan meteran listrik.",
    "Jika Anda ingin mendaftar untuk sambungan listrik baru, Anda dapat mengunjungi kantor PLN atau menggunakan aplikasi PLN Mobile untuk mengajukan permohonan sambungan listrik baru. Pastikan Anda menyiapkan dokumen yang diperlukan.",
    "Dokumen yang dibutuhkan untuk pemasangan listrik baru antara lain fotokopi KTP, surat permohonan pemasangan sambungan listrik baru, serta data lokasi pemasangan yang sudah memenuhi syarat teknis PLN.",
    "Waktu yang dibutuhkan untuk pemasangan sambungan listrik baru biasanya sekitar 7-14 hari kerja setelah pengajuan permohonan dan verifikasi. Namun, waktu ini bisa bervariasi tergantung pada lokasi dan ketersediaan teknisi.",
    "Untuk mengurus pemasangan sambungan listrik baru, Anda bisa mengunjungi kantor PLN terdekat atau mengajukan permohonan secara online melalui aplikasi PLN Mobile. Setelah itu, PLN akan melakukan survei dan pemasangan sesuai dengan jadwal.",
    "Pemasangan sambungan listrik baru dapat dilakukan di kantor PLN terdekat atau melalui aplikasi PLN Mobile. Anda bisa mendaftar secara langsung dengan membawa dokumen persyaratan yang diperlukan.",
    "Ada biaya administrasi untuk pemasangan sambungan listrik baru, yang berbeda-beda tergantung pada daya yang diminta dan jenis sambungan. Anda bisa menanyakan informasi lebih lanjut tentang biaya di kantor PLN terdekat.",
    "Prosedur pemasangan sambungan listrik PLN dimulai dengan pengajuan permohonan melalui kantor PLN atau aplikasi PLN Mobile, diikuti oleh survei lokasi dan pemasangan jaringan listrik oleh teknisi PLN.",
    "Persyaratan untuk mengajukan sambungan listrik baru antara lain adalah fotokopi KTP, surat permohonan, dan ketersediaan lokasi untuk pemasangan jaringan listrik sesuai standar PLN.",
    "Untuk mendaftar pemasangan sambungan listrik baru, Anda bisa melakukannya secara langsung di kantor PLN atau melalui aplikasi PLN Mobile, yang memudahkan proses pengajuan secara online.",
    "Anda perlu menyiapkan dokumen seperti fotokopi KTP, surat permohonan, dan memenuhi persyaratan lokasi untuk pemasangan sambungan listrik baru. Setelah itu, Anda dapat mengajukan permohonan melalui kantor PLN atau aplikasi PLN Mobile.",
    "Anda bisa mendaftar untuk pemasangan sambungan listrik baru secara online melalui aplikasi PLN Mobile atau dengan mengunjungi kantor PLN terdekat untuk mengisi formulir dan melengkapi dokumen yang diperlukan."
        ]
      },
      {
        "tag": "gangguan_listrik",
        "patterns": [
          "Apa yang harus dilakukan jika terjadi gangguan listrik?",
    "Bagaimana cara melaporkan gangguan listrik?",
    "Apa penyebab gangguan listrik?",
    "Bagaimana cara mengetahui adanya gangguan listrik?",
    "Listrik saya mati, apa yang harus saya lakukan?",
    "Jika terjadi gangguan listrik, siapa yang harus dihubungi?",
    "Bagaimana melaporkan listrik padam ke PLN?",
    "Gangguan listrik di rumah, bagaimana cara melaporkannya?",
    "Listrik padam di daerah saya, apa yang harus saya lakukan?",
    "Apakah PLN memiliki layanan untuk melaporkan gangguan listrik?",
    "Apa yang perlu saya lakukan jika listrik rumah saya mati?",
    "Kenapa listrik saya mati tiba-tiba? Apakah itu gangguan?",
    "Bagaimana cara mengatasi gangguan listrik secara cepat?",
    "Apakah gangguan listrik dapat dilaporkan lewat aplikasi?",
    "Apa saja jenis gangguan listrik yang biasa terjadi?",
    "Gangguan listrik di jalan, siapa yang harus dihubungi?",
    "Jika ada gangguan listrik, berapa lama waktu perbaikan yang dibutuhkan?",
    "Listrik padam secara tiba-tiba, apa yang terjadi?",
    "Bagaimana cara meminta bantuan PLN untuk gangguan listrik?",
    "Gangguan listrik di rumah, siapa yang harus datang untuk memperbaiki?"
        ],
        "responses": [
          "Jika terjadi gangguan listrik, langkah pertama yang perlu dilakukan adalah memastikan apakah gangguan tersebut hanya terjadi di rumah Anda atau lebih luas. Jika hanya di rumah, periksa meteran atau panel listrik. Jika gangguan lebih luas, laporkan langsung ke PLN untuk penanganan lebih lanjut.",
    "Anda bisa melaporkan gangguan listrik melalui beberapa saluran: melalui aplikasi PLN Mobile, menghubungi call center PLN di 123, atau mengunjungi situs web PLN untuk melaporkan gangguan. Pastikan memberikan informasi yang jelas tentang lokasi dan jenis gangguan.",
    "Gangguan listrik bisa disebabkan oleh berbagai faktor, termasuk kerusakan jaringan, cuaca buruk, pemeliharaan rutin, atau masalah pada instalasi listrik rumah Anda. Jika gangguan terjadi secara tiba-tiba, segera laporkan ke PLN untuk diperiksa lebih lanjut.",
    "Untuk mengetahui adanya gangguan listrik, Anda bisa mengecek apakah hanya rumah Anda yang terpengaruh atau lebih luas. Jika gangguan terjadi secara menyeluruh, biasanya PLN akan melakukan pengumuman melalui saluran informasi resmi. Jika hanya di rumah, cek meteran listrik dan panel rumah Anda.",
    "Jika listrik mati, pertama periksa apakah pemutus arus atau MCB (Miniature Circuit Breaker) di panel listrik rumah Anda terputus. Jika tidak ada masalah di rumah, laporkan ke PLN agar teknisi dapat segera memeriksa penyebab gangguan.",
    "Jika terjadi gangguan listrik, Anda bisa menghubungi call center PLN di 123, melaporkan lewat aplikasi PLN Mobile, atau mengunjungi website resmi PLN. Petugas PLN akan segera menangani masalah tersebut.",
    "Untuk melaporkan listrik padam, Anda bisa menghubungi PLN melalui call center 123, mengunjungi situs PLN, atau menggunakan aplikasi PLN Mobile. Berikan informasi yang lengkap mengenai lokasi dan jenis gangguan agar proses perbaikan dapat dilakukan dengan cepat.",
    "Jika terjadi gangguan listrik di rumah, langkah pertama adalah memeriksa instalasi listrik di rumah Anda, seperti pemutus arus atau meteran. Jika tidak ada masalah di rumah, segera laporkan ke PLN agar teknisi bisa mengecek dan menangani gangguan.",
    "Jika listrik padam di daerah Anda, periksa apakah gangguan tersebut meluas ke lingkungan sekitar. Jika iya, segera laporkan ke PLN melalui saluran resmi seperti aplikasi PLN Mobile atau call center 123 untuk mendapatkan penanganan yang tepat.",
    "PLN menyediakan layanan pelaporan gangguan listrik melalui call center 123, aplikasi PLN Mobile, atau situs web resmi PLN. Laporkan jenis gangguan dan lokasi yang terpengaruh untuk memudahkan petugas dalam menangani masalah.",
    "Jika listrik rumah Anda mati, pastikan untuk memeriksa meteran atau panel listrik. Jika tidak ada masalah di instalasi rumah, segera hubungi PLN melalui aplikasi atau call center untuk melaporkan gangguan.",
    "Listrik bisa mati tiba-tiba karena beberapa alasan, seperti pemadaman bergilir, kerusakan pada jaringan, atau masalah di instalasi rumah Anda. Jika gangguan lebih luas, PLN akan segera menanganinya, sementara untuk masalah lokal, Anda bisa menghubungi PLN untuk bantuan.",
    "Untuk mengatasi gangguan listrik, pastikan untuk melaporkan masalah tersebut ke PLN melalui aplikasi PLN Mobile, call center 123, atau situs web. Petugas PLN akan segera menangani perbaikan dan menginformasikan status pemulihan gangguan.",
    "Ya, gangguan listrik dapat dilaporkan melalui aplikasi PLN Mobile dengan memilih menu laporan gangguan. Cukup masukkan lokasi dan jenis gangguan, dan PLN akan segera merespon untuk penanganan lebih lanjut.",
    "Gangguan listrik yang sering terjadi meliputi pemadaman akibat cuaca buruk, kerusakan pada jaringan distribusi, atau permasalahan teknis lainnya di instalasi rumah atau fasilitas umum. Setiap gangguan akan ditangani oleh PLN sesuai dengan jenis masalahnya.",
    "Jika terjadi gangguan listrik di jalan atau area umum, segera laporkan ke PLN melalui aplikasi atau call center. Petugas PLN akan memprioritaskan penanganan gangguan yang mempengaruhi banyak pengguna.",
    "Waktu perbaikan gangguan listrik bisa bervariasi, tergantung pada penyebab gangguan dan lokasi. Gangguan besar biasanya memerlukan waktu lebih lama untuk diperbaiki, sementara gangguan kecil dapat segera ditangani dalam beberapa jam.",
    "Jika listrik padam tiba-tiba, penyebabnya bisa karena pemadaman terencana atau gangguan teknis pada jaringan. PLN akan segera menanganinya, dan biasanya memberi informasi tentang perkiraan waktu pemulihan melalui saluran komunikasi resmi.",
    "Untuk meminta bantuan PLN terkait gangguan listrik, Anda bisa menghubungi call center 123, melaporkan melalui aplikasi PLN Mobile, atau mengunjungi website PLN. Setelah itu, PLN akan mengirim teknisi untuk memperbaiki gangguan yang terjadi.",
    "Jika ada gangguan listrik di rumah, Anda bisa melaporkannya ke PLN melalui aplikasi PLN Mobile atau call center 123. PLN akan mengirim teknisi untuk memeriksa dan memperbaiki kerusakan pada sistem kelistrikan."
        ]
      },
      {
        "tag": "pengaduan_pln",
        "patterns": [
          "Bagaimana cara mengajukan pengaduan ke PLN?",
    "Apakah ada nomor pengaduan PLN?",
    "Dimana saya bisa mengajukan keluhan kepada PLN?",
    "Apakah PLN memiliki saluran pengaduan?",
    "Bagaimana prosedur untuk melaporkan keluhan ke PLN?",
    "Jika saya memiliki masalah dengan PLN, kemana harus mengadu?",
    "Nomor telepon untuk pengaduan PLN apa?",
    "Bagaimana cara menghubungi PLN untuk pengaduan?",
    "Jika ada masalah dengan layanan PLN, bagaimana cara mengadukannya?",
    "Apakah saya bisa mengajukan pengaduan ke PLN melalui email?",
    "Apa yang harus saya lakukan jika ingin mengadu ke PLN?",
    "PLN menerima pengaduan melalui saluran apa saja?",
    "Bagaimana cara mengajukan komplain kepada PLN?",
    "Jika saya merasa tidak puas dengan layanan PLN, bagaimana cara mengajukan pengaduan?",
    "Bagaimana cara menghubungi customer service PLN?",
    "Ada layanan pengaduan apa saja dari PLN?",
    "Apakah saya bisa mengadu soal tagihan PLN?",
    "Jika saya punya masalah tentang sambungan listrik, ke mana saya harus mengadukan?",
    "Saya ingin mengadukan gangguan listrik, bagaimana caranya?"
        ],
        "responses": [
          "Untuk mengajukan pengaduan ke PLN, Anda bisa melakukannya melalui beberapa saluran. Salah satunya adalah dengan menghubungi call center PLN di nomor 123. Anda juga bisa mengajukan pengaduan melalui aplikasi PLN Mobile atau situs web resmi PLN.",
    "PLN menyediakan nomor pengaduan di 123 untuk keluhan atau pengaduan terkait layanan listrik. Anda bisa menghubungi nomor tersebut untuk melaporkan masalah atau keluhan yang Anda alami.",
    "Pengaduan terhadap layanan PLN dapat diajukan melalui berbagai saluran, termasuk call center PLN di nomor 123, aplikasi PLN Mobile, atau melalui formulir pengaduan di situs web resmi PLN. Pilih saluran yang paling nyaman bagi Anda.",
    "PLN memiliki saluran pengaduan yang dapat diakses melalui call center 123, aplikasi PLN Mobile, email, serta formulir pengaduan yang dapat diakses di situs web resmi PLN. Semua pengaduan akan diproses dengan serius dan segera ditindaklanjuti.",
    "Untuk melaporkan keluhan kepada PLN, Anda bisa menghubungi mereka melalui beberapa cara: call center 123, aplikasi PLN Mobile, email pengaduan di layanan@pln.co.id, atau melalui situs web PLN.",
    "Jika Anda memiliki masalah atau keluhan dengan PLN, Anda bisa mengadukannya melalui call center PLN di nomor 123, aplikasi PLN Mobile, atau melalui email yang disediakan oleh PLN.",
    "Nomor pengaduan PLN yang dapat dihubungi adalah 123. Anda juga bisa mengajukan pengaduan melalui aplikasi PLN Mobile atau mengunjungi situs web resmi PLN untuk formulir pengaduan.",
    "Pengaduan dapat dilakukan dengan menghubungi call center PLN di nomor 123 atau mengakses aplikasi PLN Mobile untuk melaporkan masalah yang Anda hadapi. PLN akan segera memproses pengaduan Anda.",
    "Jika Anda memiliki masalah dengan layanan PLN, Anda bisa menghubungi call center di 123, atau mengirimkan email ke layanan@pln.co.id. Selain itu, pengaduan juga bisa dilakukan melalui aplikasi PLN Mobile.",
    "Pengaduan dapat dilakukan secara langsung melalui call center PLN di 123, atau Anda dapat mengisi formulir pengaduan di situs web resmi PLN. Pastikan Anda memberikan informasi yang jelas agar pengaduan dapat diproses dengan cepat.",
    "Jika Anda ingin mengajukan keluhan atau komplain ke PLN, Anda bisa menggunakan beberapa saluran yang tersedia, seperti call center PLN di nomor 123, aplikasi PLN Mobile, email, atau formulir pengaduan yang ada di situs web resmi PLN.",
    "Jika Anda merasa tidak puas dengan layanan PLN atau mengalami masalah, Anda bisa mengajukan pengaduan melalui call center PLN di nomor 123, atau melalui aplikasi PLN Mobile dan email yang disediakan.",
    "PLN menerima pengaduan melalui call center 123, aplikasi PLN Mobile, dan situs web PLN. Anda juga bisa menghubungi PLN melalui email untuk pengaduan yang lebih mendetail.",
    "Untuk mengajukan komplain atau pengaduan terkait layanan PLN, Anda dapat melakukannya dengan menghubungi call center di 123, melalui aplikasi PLN Mobile, atau mengirimkan email ke layanan@pln.co.id.",
    "Jika Anda memiliki masalah dengan tagihan atau layanan PLN lainnya, Anda bisa mengajukan pengaduan melalui call center PLN di 123, aplikasi PLN Mobile, atau mengunjungi situs web PLN untuk mengisi formulir pengaduan.",
    "Untuk pengaduan terkait sambungan listrik, Anda bisa menghubungi call center PLN di 123, menggunakan aplikasi PLN Mobile, atau mengirimkan email ke layanan@pln.co.id.",
    "Jika Anda mengalami gangguan listrik atau masalah terkait kelistrikan, segera laporkan melalui call center PLN di 123, aplikasi PLN Mobile, atau formulir pengaduan di situs web resmi PLN untuk mendapatkan penyelesaian."
        ]
      },
      {
        "tag": "tarif_listrik",
        "patterns": [
         "Berapa tarif listrik saat ini?",
    "Bagaimana cara mengetahui tarif listrik?",
    "Apa saja faktor yang mempengaruhi tarif listrik?",
    "Berapa tarif listrik per kWh sekarang?",
    "Bagaimana cara mengetahui tarif listrik PLN?",
    "Tarif listrik saat ini bagaimana?",
    "Dimana saya bisa mengecek tarif listrik?",
    "Bagaimana cara cek tarif listrik terbaru?",
    "Tarif listrik PLN terbaru berapa?",
    "Apakah tarif listrik PLN berubah setiap bulan?",
    "Apa tarif listrik untuk rumah tangga?",
    "Bagaimana cara mengetahui tarif listrik per kWh?",
    "Berapa tarif listrik untuk bisnis atau usaha?",
    "Bagaimana tarif listrik untuk pelanggan pelanggan bisnis?",
    "Apakah ada tarif listrik berbeda untuk rumah tangga dan bisnis?",
    "Berapa tarif listrik untuk kategori sosial?",
    "Bagaimana cara mengecek tarif listrik berdasarkan daya?",
    "Apakah tarif listrik per kWh di Indonesia sama di seluruh daerah?",
    "Apa yang mempengaruhi perubahan tarif listrik?",
    "Apakah tarif listrik untuk pelanggan rumah tangga mengalami perubahan?",
    "Berapa tarif listrik untuk golongan pelanggan R1?",
    "Bagaimana cara menghitung tagihan listrik berdasarkan tarif?",
    "Apakah PLN memiliki tarif listrik yang berbeda untuk siang dan malam?",
    "Tarif listrik PLN apa yang berlaku di 2024?",
    "Bagaimana tarif listrik ditentukan oleh PLN?"
        ],
        "responses": [
          "Tarif listrik di Indonesia saat ini ditentukan oleh golongan pelanggan dan daya yang digunakan. Untuk mengetahui tarif listrik, Anda bisa mengunjungi situs web PLN atau mengakses aplikasi PLN Mobile untuk informasi yang paling update.",
    "Untuk mengetahui tarif listrik, Anda bisa memeriksa di situs resmi PLN, melalui aplikasi PLN Mobile, atau menghubungi call center PLN di nomor 123. Tarif listrik ditentukan berdasarkan golongan pelanggan dan daya yang digunakan.",
    "Tarif listrik di Indonesia bervariasi tergantung pada golongan pelanggan dan daya yang digunakan. Sebagai contoh, tarif untuk rumah tangga biasanya berbeda dengan tarif untuk bisnis atau instansi. Anda bisa mengecek tarif terbaru di aplikasi PLN Mobile atau situs web PLN.",
    "Tarif listrik PLN per kWh berbeda-beda tergantung pada golongan pelanggan (misalnya rumah tangga, bisnis, atau sosial) dan daya yang digunakan. Untuk mengetahui tarif terkini, Anda bisa cek informasi di aplikasi PLN Mobile atau situs web PLN.",
    "Untuk mengetahui tarif listrik PLN, Anda bisa mengeceknya melalui situs resmi PLN atau menggunakan aplikasi PLN Mobile, di mana Anda bisa melihat informasi terbaru mengenai tarif listrik per kWh.",
    "Tarif listrik saat ini bergantung pada golongan pelanggan dan daya terpasang. PLN memperbarui tarif listrik secara berkala. Anda dapat mengecek tarif terbaru di aplikasi PLN Mobile atau situs web PLN.",
    "Anda bisa mengecek tarif listrik dengan mengunjungi situs web PLN atau menggunakan aplikasi PLN Mobile yang menyediakan informasi terkait tarif listrik yang berlaku saat ini.",
    "Tarif listrik terbaru dapat dilihat melalui aplikasi PLN Mobile, situs web resmi PLN, atau dengan menghubungi call center PLN di nomor 123 untuk mendapatkan informasi yang lebih detail.",
    "Tarif listrik PLN terbaru ditentukan berdasarkan golongan pelanggan dan daya terpasang. Anda bisa mendapatkan informasi tarif melalui aplikasi PLN Mobile atau situs web PLN.",
    "Tarif listrik PLN dapat berubah sesuai dengan kebijakan pemerintah atau penyesuaian tarif. Untuk informasi terkini, Anda dapat memeriksa melalui aplikasi PLN Mobile atau mengunjungi situs web resmi PLN.",
    "Tarif listrik untuk rumah tangga bervariasi tergantung pada daya yang digunakan. Untuk pelanggan rumah tangga golongan R1, tarif dihitung per kWh berdasarkan daya terpasang. Anda bisa mengecek tarif terbaru melalui aplikasi PLN Mobile.",
    "Untuk mengetahui tarif listrik per kWh, Anda bisa memeriksa di situs resmi PLN atau aplikasi PLN Mobile. Tarif per kWh berbeda-beda berdasarkan golongan dan daya terpasang pelanggan.",
    "Tarif listrik untuk bisnis atau usaha bergantung pada golongan pelanggan dan daya yang digunakan. Anda bisa cek tarif listrik untuk bisnis melalui aplikasi PLN Mobile atau situs web PLN.",
    "Ya, tarif listrik untuk pelanggan rumah tangga dan bisnis berbeda. Untuk informasi lebih lanjut, Anda bisa mengecek tarif listrik berdasarkan golongan pelanggan di situs web PLN atau aplikasi PLN Mobile.",
    "Tarif listrik untuk kategori sosial biasanya memiliki tarif yang lebih rendah dibandingkan dengan pelanggan rumah tangga atau bisnis. Informasi lebih lengkap mengenai tarif sosial dapat ditemukan di aplikasi PLN Mobile.",
    "Untuk mengetahui tarif listrik berdasarkan daya, Anda bisa memeriksa kategori golongan pelanggan Anda di situs web PLN atau aplikasi PLN Mobile, yang menyediakan informasi lengkap tentang tarif per kWh sesuai dengan daya terpasang.",
    "Tarif listrik PLN bisa berbeda di tiap daerah tergantung pada kebijakan pemerintah dan regulasi setempat. Anda bisa mengecek tarif yang berlaku di daerah Anda melalui aplikasi PLN Mobile atau situs web resmi PLN.",
    "Perubahan tarif listrik biasanya dipengaruhi oleh kebijakan pemerintah atau penyesuaian biaya operasional PLN. Untuk informasi tentang tarif yang terbaru, Anda dapat mengakses aplikasi PLN Mobile atau situs web PLN.",
    "Tarif listrik untuk pelanggan rumah tangga biasanya mengalami penyesuaian berdasarkan golongan dan daya yang terpasang. Anda dapat melihat tarif terkini di aplikasi PLN Mobile atau situs web PLN.",
    "Untuk pelanggan golongan R1 (rumah tangga), tarif listrik dihitung berdasarkan daya terpasang dan konsumsi listrik bulanan. Anda bisa mengecek tarif listrik golongan R1 melalui aplikasi PLN Mobile.",
    "Untuk menghitung tagihan listrik berdasarkan tarif, Anda bisa mengalikan tarif per kWh dengan jumlah konsumsi listrik Anda dalam satu bulan. Tarif per kWh dapat ditemukan di aplikasi PLN Mobile atau situs web PLN.",
    "PLN tidak memiliki tarif listrik yang berbeda antara siang dan malam. Namun, tarif listrik dapat berbeda berdasarkan golongan dan daya yang digunakan. Anda bisa mengecek informasi lebih lanjut di aplikasi PLN Mobile.",
    "Tarif listrik PLN yang berlaku di tahun 2024 dapat diakses melalui aplikasi PLN Mobile atau situs web PLN. Pastikan Anda selalu memeriksa informasi terbaru untuk mendapatkan tarif yang akurat.",
    "PLN menentukan tarif listrik berdasarkan golongan pelanggan, daya terpasang, dan konsumsi listrik. Tarif tersebut juga dapat berubah sesuai dengan kebijakan pemerintah. Anda dapat mengakses informasi tarif melalui aplikasi PLN Mobile atau situs web resmi PLN."
        ]
      },
      {
        "tag": "meteran_listrik",
        "patterns": [
          "Bagaimana cara membaca meteran listrik?",
    "Apa yang harus dilakukan jika meteran listrik tidak berfungsi?",
    "Meteran listrik saya tidak berfungsi, apa yang harus saya lakukan?",
    "Bagaimana cara memeriksa pembacaan meteran listrik?",
    "Kenapa meteran listrik tidak berjalan?",
    "Meteran listrik saya error, bagaimana cara mengatasinya?",
    "Bagaimana cara mengetahui angka pada meteran listrik?",
    "Apakah saya bisa membaca meteran listrik secara manual?",
    "Kenapa meteran listrik rumah saya tidak menunjukkan angka?",
    "Meteran listrik digital saya bermasalah, apa yang harus dilakukan?",
    "Apa penyebab meteran listrik tidak mencatat penggunaan?",
    "Apakah ada cara untuk menguji meteran listrik?",
    "Bagaimana cara mengatasi gangguan pada meteran listrik?",
    "Kenapa meteran listrik saya tidak mencatat pemakaian?",
    "Bagaimana cara menghubungi PLN jika meteran listrik bermasalah?",
    "Bagaimana jika meteran listrik saya tidak bekerja dengan baik?",
    "Apa yang menyebabkan meteran listrik tidak akurat?",
    "Meteran listrik analog saya tidak berfungsi, apa yang harus dilakukan?",
    "Apakah ada petunjuk untuk mengatasi masalah pada meteran listrik?",
    "Bagaimana cara memperbaiki meteran listrik yang rusak?",
    "Meteran listrik saya tidak mencatat pemakaian, siapa yang harus dihubungi?"
        ],
        "responses": [
          "Untuk membaca meteran listrik, perhatikan angka yang tertera pada layar meteran. Jika meteran analog, Anda akan melihat angka yang menunjukkan angka konsumsi listrik Anda dalam kWh. Untuk meteran digital, angka yang tertera juga menunjukkan total pemakaian listrik dalam kWh. Pastikan membaca angka terakhir dan mengabaikan angka-angka sebelumnya jika meteran sudah ter-reset.",
    "Jika meteran listrik Anda tidak berfungsi, coba periksa apakah ada masalah pada sambungan atau kabelnya. Jika tidak ada masalah dengan sambungan dan meteran tetap tidak berfungsi, segera hubungi PLN melalui nomor call center 123 untuk melaporkan kerusakan meteran.",
    "Jika meteran listrik Anda tidak berfungsi, pertama pastikan meteran tidak terhalang oleh benda atau kotoran yang mengganggu pembacaan. Jika sudah diperiksa dan masih tidak berfungsi, laporkan ke PLN untuk pemeriksaan lebih lanjut.",
    "Untuk memeriksa pembacaan meteran listrik, perhatikan angka yang ada di meteran listrik Anda. Biasanya, ada dua jenis pembacaan: total pemakaian (angka yang tertera) dan angka yang digunakan untuk menghitung tagihan listrik Anda. Catat angka tersebut untuk memeriksa pemakaian listrik Anda.",
    "Jika meteran listrik Anda tidak berjalan, pertama pastikan tidak ada masalah dengan sambungan listrik di rumah. Jika sambungan baik-baik saja dan meteran tetap tidak berfungsi, segera laporkan masalah ini ke PLN.",
    "Jika meteran listrik Anda error atau tidak berfungsi, coba matikan aliran listrik dan hidupkan kembali. Jika masih tidak berfungsi, Anda bisa melaporkan kerusakan tersebut ke PLN agar dilakukan pengecekan dan perbaikan.",
    "Untuk mengetahui angka pada meteran listrik, lihat angka yang tertera pada layar meteran. Jika menggunakan meteran analog, angka yang menunjukkan konsumsi listrik akan terlihat dengan jelas pada roda meteran. Pada meteran digital, angka akan langsung tampil di layar.",
    "Ya, Anda bisa membaca meteran listrik secara manual dengan mencatat angka yang tertera pada layar meteran listrik Anda. Catat angka tersebut secara berkala untuk memonitor konsumsi listrik Anda dan memperkirakan tagihan.",
    "Jika meteran listrik Anda tidak menunjukkan angka, periksa apakah ada masalah dengan sumber daya atau sambungan listrik. Jika masalah tetap ada, hubungi PLN untuk melakukan pemeriksaan dan perbaikan pada meteran.",
    "Jika meteran listrik digital Anda bermasalah, pastikan meteran dalam kondisi baik dan tidak ada gangguan dari lingkungan sekitar (misalnya, benda yang menghalangi sensor). Jika meteran tetap tidak berfungsi, segera hubungi PLN untuk dilakukan pengecekan.",
    "Penyebab meteran listrik tidak mencatat penggunaan bisa disebabkan oleh gangguan pada meteran, kerusakan pada komponen internalnya, atau masalah pada sistem kelistrikan rumah Anda. Jika ini terjadi, segera laporkan ke PLN untuk perbaikan.",
    "Untuk menguji meteran listrik, Anda bisa melakukan pengecekan dengan memonitor angka pada meteran sebelum dan setelah menggunakan sejumlah alat listrik. Jika ada ketidaksesuaian, laporkan masalah tersebut ke PLN.",
    "Jika terjadi gangguan pada meteran listrik, langkah pertama adalah memeriksa sambungan dan memastikan tidak ada kerusakan fisik. Jika masalah berlanjut, Anda harus menghubungi PLN agar petugas melakukan pengecekan dan perbaikan pada meteran listrik.",
    "Meteran listrik yang tidak mencatat pemakaian bisa disebabkan oleh kesalahan teknis atau gangguan pada sambungan. Segera laporkan masalah ini ke PLN untuk pemeriksaan lebih lanjut dan perbaikan.",
    "Jika meteran listrik Anda tidak bekerja dengan baik, pastikan bahwa meteran terhubung dengan benar ke sistem kelistrikan rumah. Jika meteran tetap tidak berfungsi, Anda harus menghubungi PLN untuk pemeriksaan dan perbaikan.",
    "Beberapa penyebab meteran listrik tidak akurat bisa mencakup kerusakan pada alat ukur atau gangguan pada sambungan listrik. Untuk masalah seperti ini, segera hubungi PLN agar masalah bisa segera diatasi.",
    "Jika meteran listrik Anda analog dan tidak berfungsi, coba periksa apakah ada masalah pada roda meter atau indikator. Jika meteran tetap tidak berfungsi, laporkan masalah ke PLN untuk penggantian atau perbaikan.",
    "Untuk mengatasi masalah pada meteran listrik, pastikan meteran tidak terhalang kotoran atau benda lainnya. Jika meteran tetap tidak berfungsi, hubungi PLN agar teknisi dapat memeriksa dan memperbaikinya.",
    "Jika meteran listrik Anda rusak, Anda bisa melaporkannya ke PLN melalui call center atau aplikasi PLN Mobile. PLN akan mengirimkan teknisi untuk memeriksa dan mengganti meteran yang rusak.",
    "Jika meteran listrik Anda tidak mencatat pemakaian, Anda harus segera melaporkannya ke PLN. Teknisi PLN akan datang untuk memeriksa dan memperbaiki atau mengganti meteran yang bermasalah."
        ]
      },
      {
        "tag": "pemutusan_listrik",
        "patterns": [
          "Bagaimana cara mengajukan pemutusan listrik?",
    "Apa yang harus dilakukan untuk mematikan sambungan listrik?",
    "Bagaimana cara memutuskan sambungan listrik rumah?",
    "Apa prosedur untuk meminta pemutusan listrik?",
    "Bagaimana jika ingin mematikan sambungan listrik PLN?",
    "Bagaimana cara melakukan permohonan pemutusan listrik?",
    "Bagaimana cara memutuskan listrik PLN sementara?",
    "Apakah saya bisa meminta pemutusan listrik untuk sementara waktu?",
    "Bagaimana cara melakukan pemutusan sambungan listrik secara permanen?",
    "Saya ingin menghentikan sambungan listrik sementara, bagaimana caranya?",
    "Apa yang harus dilakukan untuk mematikan meteran listrik?",
    "Saya ingin memutuskan sambungan listrik sementara, bagaimana prosesnya?",
    "Bagaimana cara mengajukan permintaan untuk menghentikan layanan listrik?",
    "Apa yang harus saya lakukan untuk memutuskan sambungan listrik rumah?",
    "Apakah ada cara untuk mengajukan pemutusan listrik sementara?",
    "Bagaimana cara mengajukan pemutusan listrik karena pindah rumah?",
    "Apakah ada biaya untuk pemutusan sambungan listrik?"
        ],
        "responses": [
          "Untuk mengajukan pemutusan listrik, Anda bisa menghubungi PLN melalui call center di nomor 123 atau menggunakan aplikasi PLN Mobile. Anda juga bisa mengajukan permohonan pemutusan melalui website resmi PLN dengan mengisi formulir yang disediakan.",
    "Jika Anda ingin mematikan sambungan listrik, Anda dapat menghubungi PLN untuk meminta pemutusan sambungan. Biasanya, Anda perlu memberikan data pelanggan, alasan pemutusan, serta rincian lainnya terkait permohonan tersebut.",
    "Untuk memutuskan sambungan listrik rumah, Anda perlu menghubungi PLN dan mengajukan permohonan pemutusan. Anda dapat melakukannya melalui aplikasi PLN Mobile, call center PLN, atau datang langsung ke kantor PLN terdekat.",
    "Prosedur pemutusan listrik dimulai dengan menghubungi PLN melalui saluran resmi, seperti call center atau aplikasi PLN Mobile. Anda perlu memberikan informasi lengkap terkait pemutusan, termasuk alamat dan nomor ID pelanggan.",
    "Jika Anda ingin mematikan sambungan listrik PLN, Anda bisa menghubungi call center PLN di 123 atau menggunakan aplikasi PLN Mobile untuk meminta pemutusan sambungan. Anda juga bisa mengunjungi kantor PLN terdekat untuk permohonan pemutusan.",
    "Untuk melakukan pemutusan sambungan listrik, Anda perlu mengajukan permohonan ke PLN dengan menghubungi call center atau melalui aplikasi PLN Mobile. Jangan lupa untuk memberikan informasi terkait alamat dan nomor pelanggan Anda.",
    "Jika Anda memerlukan pemutusan listrik sementara, Anda bisa mengajukan permohonan ke PLN. Prosesnya bisa dilakukan dengan menghubungi PLN melalui call center atau aplikasi PLN Mobile. Pastikan untuk memberi informasi yang lengkap mengenai kebutuhan Anda.",
    "Untuk memutuskan listrik PLN secara sementara, Anda bisa mengajukan permohonan ke PLN dengan menyertakan alasan permintaan tersebut. Anda dapat melakukan pengajuan melalui aplikasi PLN Mobile atau menghubungi call center PLN.",
    "Untuk pemutusan sambungan listrik secara permanen, Anda bisa mengajukan permohonan ke PLN. Hubungi call center PLN atau gunakan aplikasi PLN Mobile untuk memberikan informasi terkait permohonan Anda.",
    "Jika Anda ingin menghentikan sambungan listrik sementara, Anda dapat mengajukan permohonan melalui aplikasi PLN Mobile atau menghubungi call center PLN di 123. Jelaskan dengan jelas alasan Anda mengajukan pemutusan sementara.",
    "Untuk mematikan meteran listrik, Anda bisa mematikan saklar utama atau memutuskan sambungan listrik di rumah Anda. Namun, jika Anda ingin pemutusan layanan resmi oleh PLN, Anda perlu mengajukan permohonan pemutusan kepada PLN.",
    "Proses pemutusan sambungan listrik sementara dilakukan dengan menghubungi PLN. Anda dapat melakukannya melalui aplikasi PLN Mobile atau menelepon call center PLN untuk memberikan informasi yang diperlukan, seperti alamat dan nomor pelanggan.",
    "Jika Anda ingin mengajukan permohonan untuk menghentikan layanan listrik, Anda bisa menghubungi PLN melalui aplikasi PLN Mobile atau menelepon call center PLN di nomor 123. Pastikan Anda memberikan alasan yang jelas terkait permohonan pemutusan.",
    "Untuk memutuskan sambungan listrik rumah, Anda dapat menghubungi PLN dan mengajukan permohonan pemutusan. Anda bisa melakukannya melalui aplikasi PLN Mobile atau menelepon call center PLN untuk membantu prosesnya.",
    "Jika Anda ingin mengajukan pemutusan listrik sementara karena pindah rumah, Anda bisa menghubungi PLN melalui call center di 123 atau menggunakan aplikasi PLN Mobile. Pastikan Anda memberikan informasi yang lengkap terkait alamat baru dan alasan pemutusan.",
    "Terkait biaya pemutusan sambungan listrik, biasanya ada biaya administrasi yang dikenakan oleh PLN. Untuk informasi lebih lanjut tentang biaya yang berlaku, Anda dapat menghubungi PLN melalui call center atau mengunjungi kantor PLN terdekat."
        ]
      },
      {
        "tag": "program_bantuan_pln",
        "patterns": [
          "Apakah ada program bantuan listrik untuk masyarakat?",
    "Apa saja program bantuan yang diberikan PLN?",
    "Program bantuan listrik apa saja yang disediakan PLN?",
    "Bagaimana cara mendapatkan bantuan listrik dari PLN?",
    "Ada program subsidi listrik dari PLN?",
    "PLN punya program bantuan untuk pelanggan miskin?",
    "Apa itu program bantuan listrik PLN?",
    "Bantuan listrik apa saja yang diberikan PLN?",
    "Bagaimana cara mengakses program bantuan listrik PLN?",
    "Apa syarat untuk mendapatkan program bantuan listrik?",
    "PLN ada program untuk subsidi listrik, bagaimana cara mendapatkannya?",
    "Bagaimana cara mendaftar untuk program bantuan listrik PLN?",
    "Ada program diskon atau bantuan listrik dari PLN?",
    "Program bantuan PLN untuk masyarakat apa saja?",
    "Bagaimana cara mengikuti program bantuan listrik PLN?",
    "Apa tujuan dari program bantuan listrik PLN?",
    "Apakah PLN punya program bantuan untuk golongan tertentu?"
        ],
        "responses": [
          "PLN menyediakan beberapa program bantuan listrik bagi masyarakat, seperti program **Bantuan Langsung Tunai (BLT)** bagi pelanggan dengan daya 450 VA, serta program **Subsidy Cross-Subsidy (SCS)** yang membantu masyarakat berpenghasilan rendah. Program bantuan ini bertujuan untuk meringankan beban biaya listrik bagi keluarga yang membutuhkan.",
    "PLN memiliki beberapa program bantuan untuk masyarakat, di antaranya adalah program **Subsidy for 450 VA & 900 VA customers**, yang menyasar pelanggan rumah tangga dengan daya rendah. Bantuan ini diberikan untuk memastikan mereka tetap dapat menikmati layanan listrik dengan tarif yang lebih terjangkau.",
    "Beberapa program bantuan yang diberikan oleh PLN antara lain adalah **program subsidi listrik** untuk pelanggan dengan daya 450 VA dan 900 VA, yang bertujuan untuk membantu pelanggan dengan kondisi ekonomi terbatas agar tetap bisa membayar tagihan listrik dengan biaya yang lebih ringan.",
    "Untuk mendapatkan bantuan listrik dari PLN, Anda bisa memanfaatkan program **subsidi listrik** yang telah ditentukan pemerintah. Anda dapat mengajukan melalui aplikasi PLN Mobile atau melalui kantor PLN terdekat dengan memenuhi persyaratan yang berlaku.",
    "PLN memberikan program subsidi untuk golongan tertentu seperti **pelanggan daya 450 VA** dan **900 VA** yang memenuhi syarat. Program bantuan ini bertujuan untuk menurunkan biaya tagihan listrik bagi rumah tangga dengan penghasilan rendah.",
    "Program bantuan PLN yang terkenal adalah **Bantuan Sosial Listrik**, yang menawarkan subsidi dan diskon tarif untuk golongan rumah tangga yang kurang mampu. Pastikan untuk memeriksa syarat-syarat kelayakan di kantor PLN atau melalui aplikasi PLN Mobile.",
    "Program bantuan listrik PLN termasuk subsidi bagi pelanggan dengan daya 450 VA dan 900 VA, yang tujuannya adalah untuk memastikan mereka mendapatkan harga listrik yang lebih terjangkau. Bantuan ini diberikan oleh pemerintah dan dikelola oleh PLN.",
    "PLN juga memberikan **Bantuan Langsung Tunai (BLT)** bagi masyarakat dengan kriteria tertentu. Program ini menawarkan potongan harga atau bantuan langsung dalam pembayaran tagihan listrik untuk golongan yang benar-benar membutuhkan.",
    "Untuk mengakses program bantuan listrik PLN, Anda bisa mengajukan permohonan melalui aplikasi PLN Mobile atau datang ke kantor PLN terdekat. Pastikan Anda memenuhi kriteria sebagai penerima bantuan, seperti penghasilan rendah dan status pelanggan yang sesuai.",
    "Syarat untuk mendapatkan program bantuan listrik PLN adalah Anda harus terdaftar sebagai pelanggan dengan daya 450 VA atau 900 VA dan memenuhi kriteria ekonomi tertentu. Pengajuan bantuan bisa dilakukan melalui aplikasi PLN Mobile atau dengan mengunjungi kantor PLN terdekat.",
    "PLN memiliki program subsidi untuk pelanggan rumah tangga dengan daya 450 VA dan 900 VA. Anda bisa mendapatkan informasi lebih lanjut tentang cara pendaftaran dan syarat kelayakan melalui aplikasi PLN Mobile atau call center PLN.",
    "Program bantuan listrik PLN bertujuan untuk mengurangi beban masyarakat berpenghasilan rendah dalam membayar tagihan listrik. Bantuan ini umumnya berupa subsidi dan diskon tarif untuk pelanggan rumah tangga tertentu, seperti yang terdaftar pada daya 450 VA dan 900 VA.",
    "Untuk mengikuti program bantuan listrik PLN, Anda bisa mendaftar melalui aplikasi PLN Mobile atau mengunjungi kantor PLN terdekat dengan membawa dokumen yang menunjukkan status sosial dan ekonomi Anda.",
    "Tujuan dari program bantuan listrik PLN adalah untuk memastikan masyarakat yang kurang mampu tetap dapat menikmati listrik dengan tarif yang lebih terjangkau, sehingga membantu mereka dalam kesejahteraan sosial dan ekonomi.",
    "PLN menawarkan program bantuan khusus untuk pelanggan dengan daya 450 VA dan 900 VA, terutama bagi mereka yang memiliki penghasilan terbatas. Program ini bertujuan untuk mengurangi kesulitan dalam pembayaran tagihan listrik bagi golongan masyarakat tersebut."
        ]
      },
      {
        "tag": "goodbye",
        "patterns": [
          "Terima kasih",
    "Makasih",
    "Dadah",
    "Sampai jumpa",
    "Goodbye",
    "Selamat tinggal",
    "Bye",
    "Terima kasih banyak",
    "See you",
    "Sampai ketemu lagi",
    "Makasih banyak",
    "Terima kasih sudah membantu",
    "Bye bye",
    "Selamat tinggal dan terima kasih",
    "Sampai bertemu lagi",
    "Terima kasih, sampai jumpa"
        ],
        "responses": [
          "Sama-sama, terima kasih telah menghubungi kami! Semoga hari Anda menyenankan!",
    "Terima kasih sudah menggunakan layanan kami. Sampai jumpa lagi!",
    "Senang bisa membantu! Semoga hari Anda menyenangkan. Sampai jumpa!",
    "Terima kasih banyak! Jika Anda membutuhkan bantuan lagi, kami siap membantu.",
    "Dadah! Semoga semuanya lancar dan sampai bertemu lagi!",
    "Selamat tinggal, semoga hari Anda penuh kebahagiaan!",
    "Bye, semoga informasi yang Anda cari bermanfaat! Jangan ragu untuk kembali lagi.",
    "Sampai jumpa, terima kasih sudah menggunakan layanan PLN. Kami selalu siap membantu!",
    "Terima kasih telah menghubungi kami! Semoga semuanya berjalan lancar. Sampai jumpa!",
    "Sampai ketemu lagi! Jangan sungkan untuk bertanya lagi kalau ada yang ingin diketahui.",
    "Terima kasih banyak, semoga hari Anda menyenankan dan selalu sukses!",
    "Selamat tinggal, semoga apa yang Anda cari telah terjawab dengan baik.",
    "Bye bye! Semoga hari Anda menyenankan, dan terima kasih atas kepercayaannya.",
    "Selamat tinggal dan terima kasih atas kunjungannya, semoga dapat membantu Anda kembali di lain waktu.",
    "Sampai bertemu lagi! Jangan ragu untuk menghubungi kami kapan saja.",
    "Terima kasih, sampai jumpa lagi! Kami siap membantu kapan pun Anda butuhkan."
        ]
      },
      {
        "tag": "pemasangan_meteran",
        "patterns": [
            "Bagaimana cara memasang meteran listrik baru?",
            "Prosedur pemasangan meteran listrik seperti apa?",
            "Apa langkah-langkah untuk pemasangan meteran listrik?",
            "Bagaimana cara mendaftar untuk pemasangan meteran listrik baru?",
            "Apa yang diperlukan untuk pemasangan meteran listrik?",
            "Bagaimana prosedur pengajuan pemasangan meteran baru?",
            "Pemasangan meteran listrik baru itu seperti apa?",
            "Apa syarat untuk pemasangan meteran listrik baru?",
            "Berapa lama waktu yang dibutuhkan untuk pemasangan meteran listrik baru?",
            "Cara memasang meteran listrik baru di rumah, bagaimana?",
            "Ada biaya untuk pemasangan meteran listrik baru?",
            "Pemasangan meteran listrik baru dilakukan oleh siapa?",
            "Berapa biaya pemasangan meteran listrik baru?",
            "Apa saja dokumen yang diperlukan untuk pemasangan meteran listrik?",
            "Pemasangan meteran baru untuk rumah, apa syaratnya?"
        ],
        "responses": [
          "Untuk memasang meteran listrik baru, Anda harus mengajukan permohonan terlebih dahulu melalui aplikasi PLN Mobile atau di kantor PLN terdekat. Prosesnya melibatkan pengisian formulir permohonan, verifikasi data, serta instalasi meteran oleh petugas PLN.",
    "Prosedur pemasangan meteran listrik baru dimulai dengan pengajuan permohonan ke PLN. Anda perlu mengisi formulir dan melengkapi dokumen yang diperlukan seperti fotokopi KTP dan KK. Setelah itu, petugas PLN akan melakukan survei lokasi dan pemasangan meteran di tempat Anda.",
    "Langkah pertama untuk pemasangan meteran listrik baru adalah mengajukan permohonan melalui aplikasi PLN Mobile atau datang langsung ke kantor PLN. Anda juga perlu menyiapkan dokumen yang diperlukan dan membayar biaya pemasangan yang sesuai dengan ketentuan PLN.",
    "Prosedur untuk pemasangan meteran listrik baru melibatkan beberapa langkah. Pertama, Anda harus mengajukan permohonan pemasangan meteran ke PLN dengan melampirkan dokumen yang diperlukan. Setelah itu, petugas PLN akan datang untuk melakukan survei dan pemasangan meteran.",
    "Untuk melakukan pemasangan meteran listrik baru, Anda perlu mengajukan permohonan terlebih dahulu. Proses ini termasuk pengisian data pelanggan baru, pembayaran biaya pemasangan, serta pemasangan meteran oleh teknisi PLN yang terjadwal sesuai lokasi Anda.",
    "Pemasangan meteran listrik baru dilakukan setelah Anda mengajukan permohonan ke PLN. Anda akan diminta untuk melengkapi dokumen seperti fotokopi KTP dan KK. Setelah dokumen lengkap, petugas PLN akan melakukan survei dan melaksanakan pemasangan meteran sesuai jadwal yang telah ditentukan.",
    "Untuk memasang meteran listrik baru, Anda perlu mengajukan permohonan melalui aplikasi PLN Mobile atau datang langsung ke kantor PLN. Petugas PLN akan melakukan verifikasi dan survei lokasi, kemudian memasang meteran sesuai dengan prosedur yang berlaku.",
    "Pemasangan meteran listrik baru dilakukan setelah Anda mengajukan permohonan ke PLN. Syarat utama untuk pemasangan adalah melengkapi dokumen identitas, memilih daya listrik yang dibutuhkan, dan membayar biaya pemasangan yang sesuai dengan ketentuan PLN.",
    "Proses pemasangan meteran baru dimulai dengan mengajukan permohonan kepada PLN dan melengkapi dokumen persyaratan, seperti fotokopi KTP, KK, dan bukti kepemilikan tempat. Biaya pemasangan akan disesuaikan dengan jenis layanan dan daya yang Anda pilih.",
    "Biaya untuk pemasangan meteran listrik baru biasanya akan disesuaikan dengan daya yang Anda pilih dan biaya administrasi. Anda dapat mengecek rincian biaya ini saat mengajukan permohonan melalui aplikasi PLN Mobile atau di kantor PLN.",
    "Pemasangan meteran listrik baru dilakukan oleh petugas teknisi PLN yang terlatih. Setelah pengajuan disetujui dan biaya pemasangan dibayar, petugas akan datang untuk memasang meteran dan melakukan pengaturan sesuai kebutuhan daya Anda.",
    "Pemasangan meteran listrik baru memerlukan beberapa dokumen seperti fotokopi KTP, KK, dan bukti kepemilikan tempat tinggal. Pastikan juga Anda mengetahui jenis daya listrik yang dibutuhkan untuk rumah atau bisnis Anda, agar pemasangan dapat berjalan lancar.",
    "Pemasangan meteran listrik baru dilakukan oleh petugas teknisi PLN setelah Anda mengajukan permohonan dan melakukan pembayaran biaya pemasangan. Petugas akan melakukan survei untuk memastikan kelayakan lokasi pemasangan meteran.",
    "Untuk pemasangan meteran listrik baru, Anda akan dikenakan biaya pemasangan yang dapat bervariasi tergantung pada daya yang dipilih dan lokasi pemasangan. Biaya tersebut bisa dilihat pada saat pengajuan permohonan di aplikasi PLN Mobile atau kantor PLN.",
    "Pemasangan meteran baru memerlukan beberapa dokumen persyaratan seperti fotokopi identitas diri (KTP dan KK), bukti kepemilikan tempat tinggal, serta pemilihan daya listrik yang diinginkan. Setelah itu, teknisi PLN akan datang untuk memasang meteran di lokasi yang sesuai.",
    "Pemasangan meteran listrik baru dilakukan oleh teknisi PLN yang akan memeriksa lokasi dan memastikan instalasi sesuai standar. Proses ini termasuk pembayaran biaya pemasangan, pengisian formulir permohonan, dan penyelesaian administrasi lainnya."
        ]
      },
      {
        "tag": "gangguan_jaringan",
        "patterns": [
          "Ada gangguan pada jaringan listrik, apa yang harus dilakukan?",
    "Jaringan listrik di daerah saya bermasalah, bagaimana cara melapor?",
    "Bagaimana cara melaporkan gangguan pada jaringan listrik?",
    "Listrik mati di daerah saya, bagaimana cara melapor?",
    "Ada gangguan jaringan listrik, bagaimana cara laporkan ke PLN?",
    "Listrik di rumah saya mati karena gangguan jaringan, apa yang harus dilakukan?",
    "Apa langkah pertama jika terjadi gangguan pada jaringan listrik?",
    "Jaringan listrik saya terganggu, siapa yang harus dihubungi?",
    "Ada kerusakan jaringan listrik, siapa yang bisa dihubungi?",
    "Jika ada gangguan pada jaringan listrik, bagaimana cara memperbaikinya?",
    "Jaringan listrik bermasalah, siapa yang bertanggung jawab?",
    "PLN bisa bantu untuk gangguan jaringan listrik, bagaimana cara hubungi?"
        ],
        "responses": [
          "Jika Anda mengalami gangguan pada jaringan listrik, segera laporkan ke PLN melalui beberapa saluran komunikasi. Anda bisa menggunakan aplikasi PLN Mobile, menghubungi pusat layanan pelanggan di 123, atau melaporkan melalui website resmi PLN. Sebutkan detail gangguan dan lokasi untuk mempercepat penanganan.",
    "Jika ada gangguan jaringan listrik di daerah Anda, pertama-tama pastikan untuk tidak mencoba memperbaikinya sendiri. Segera laporkan ke PLN melalui aplikasi PLN Mobile atau hubungi layanan pelanggan PLN di nomor 123. Berikan informasi yang jelas mengenai lokasi dan jenis gangguan yang terjadi.",
    "Untuk melaporkan gangguan pada jaringan listrik, Anda bisa menggunakan aplikasi PLN Mobile yang dapat memberikan update real-time tentang status gangguan. Alternatif lainnya adalah menghubungi pusat layanan pelanggan PLN di nomor 123, atau melaporkan melalui website resmi PLN.",
    "Jika jaringan listrik di daerah Anda bermasalah, segera laporkan ke PLN dengan memberikan informasi lengkap seperti alamat dan jenis gangguan yang terjadi. Anda dapat melapor melalui aplikasi PLN Mobile, menghubungi call center di 123, atau mengunjungi kantor PLN terdekat.",
    "Langkah pertama yang harus dilakukan jika terjadi gangguan pada jaringan listrik adalah melaporkan kejadian tersebut ke PLN. Gunakan aplikasi PLN Mobile untuk melaporkan masalah, atau hubungi layanan pelanggan PLN di 123. Pastikan Anda memberikan informasi yang jelas tentang lokasi dan jenis gangguan.",
    "Jika Anda mengalami gangguan jaringan listrik, Anda bisa melapor ke PLN melalui aplikasi PLN Mobile atau dengan menghubungi nomor layanan pelanggan di 123. Jelaskan masalah secara rinci, termasuk lokasi dan jenis gangguan yang terjadi, agar PLN dapat segera menangani.",
    "Jika listrik mati di rumah Anda akibat gangguan jaringan, pastikan untuk melaporkan kejadian tersebut ke PLN. Anda bisa melapor menggunakan aplikasi PLN Mobile, melalui panggilan telepon ke 123, atau mengunjungi kantor PLN terdekat. Jelaskan lokasi dan permasalahan dengan jelas agar PLN dapat segera memproses laporan Anda.",
    "Untuk melaporkan gangguan jaringan listrik, Anda dapat menghubungi layanan pelanggan PLN di nomor 123 atau menggunakan aplikasi PLN Mobile untuk melaporkan masalah yang Anda alami. Sebutkan lokasi dan rincian gangguan agar PLN bisa segera mengatasi masalah tersebut.",
    "Jika ada kerusakan pada jaringan listrik, segera hubungi PLN melalui aplikasi PLN Mobile atau layanan pelanggan di nomor 123. Berikan informasi yang jelas mengenai lokasi gangguan dan apakah ada dampak yang lebih besar, seperti padamnya listrik secara keseluruhan.",
    "Jika ada gangguan pada jaringan listrik, Anda dapat melaporkannya ke PLN melalui beberapa saluran komunikasi. Gunakan aplikasi PLN Mobile untuk melaporkan gangguan, atau hubungi layanan pelanggan di 123. Pastikan Anda memberikan detail lokasi dan masalah untuk mempermudah proses perbaikan.",
    "Jika jaringan listrik Anda terganggu, laporkan segera ke PLN melalui aplikasi PLN Mobile atau nomor layanan pelanggan di 123. PLN akan segera menindaklanjuti laporan Anda untuk memastikan gangguan tersebut segera diperbaiki.",
    "Gangguan jaringan listrik merupakan tanggung jawab PLN untuk diperbaiki. Untuk melaporkan masalah ini, Anda dapat menghubungi PLN melalui aplikasi PLN Mobile, layanan pelanggan di nomor 123, atau kunjungi kantor PLN terdekat. PLN akan segera memproses laporan Anda dan mengatasi masalah jaringan listrik.",
    "Jika Anda mengalami gangguan pada jaringan listrik, Anda bisa menghubungi PLN melalui berbagai saluran, seperti aplikasi PLN Mobile atau layanan pelanggan di nomor 123. Pastikan untuk memberikan informasi lokasi dan jenis gangguan secara lengkap agar PLN bisa segera melakukan perbaikan."
        ]
      },
      {
        "tag": "pembayaran_pajak_listrik",
        "patterns": [
          "Bagaimana cara membayar pajak listrik?",
    "Apakah PLN juga menerima pembayaran pajak?",
    "Dimana saya bisa membayar pajak listrik?",
    "Apakah pajak listrik dibayar melalui PLN?",
    "Bagaimana cara mengetahui jumlah pajak listrik yang harus dibayar?",
    "Apakah saya harus membayar pajak listrik setiap bulan?",
    "Apakah ada pembayaran pajak listrik online?",
    "Dimana saya bisa membayar pajak listrik selain PLN?",
    "Bagaimana cara membayar pajak listrik secara online?",
    "PLN menerima pembayaran pajak listrik, bagaimana caranya?",
    "Apakah ada biaya tambahan untuk membayar pajak listrik?",
    "PLN ada aplikasi untuk bayar pajak listrik tidak?",
    "Bagaimana cara mengetahui apakah saya harus membayar pajak listrik?",
    "Apa yang termasuk dalam pembayaran pajak listrik?"
        ],
        "responses": [
          "Pajak listrik biasanya dibayarkan bersamaan dengan tagihan listrik bulanan Anda. Anda dapat membayar pajak ini melalui berbagai saluran pembayaran yang tersedia, seperti melalui bank, aplikasi pembayaran online, atau menggunakan layanan yang terhubung dengan PLN. Jika Anda membayar tagihan melalui PLN Mobile, pajak listrik akan tercantum dalam tagihan Anda.",
    "PLN tidak langsung menerima pembayaran pajak, namun Anda dapat membayar pajak listrik bersama tagihan listrik bulanan melalui berbagai metode pembayaran yang tersedia. Pastikan untuk memeriksa rincian pembayaran pada tagihan listrik Anda.",
    "Untuk membayar pajak listrik, Anda dapat melakukannya melalui saluran pembayaran yang tersedia, baik itu melalui bank, aplikasi pembayaran, atau kantor pos. Pajak listrik biasanya dibayar bersamaan dengan tagihan bulanan PLN Anda. Jika menggunakan aplikasi PLN Mobile, Anda dapat melakukan pembayaran pajak ini dengan mudah.",
    "Pajak listrik tidak dibayar langsung ke PLN, tetapi dapat dibayarkan melalui berbagai saluran pembayaran seperti bank atau aplikasi pembayaran online. Pembayaran ini biasanya disertakan dalam tagihan listrik bulanan Anda, jadi pastikan untuk memeriksa rincian tagihan Anda.",
    "Untuk mengetahui jumlah pajak listrik yang harus dibayar, Anda dapat memeriksa tagihan listrik bulanan Anda. Pajak ini biasanya tertera bersama dengan biaya konsumsi listrik dan dapat dibayar melalui bank atau aplikasi pembayaran yang bekerja sama dengan PLN.",
    "Pajak listrik harus dibayar sesuai dengan ketentuan yang berlaku dan biasanya tercantum dalam tagihan listrik bulanan Anda. Pembayaran pajak ini dapat dilakukan bersama tagihan listrik yang biasanya dilakukan setiap bulan.",
    "Ya, Anda bisa membayar pajak listrik secara online melalui berbagai aplikasi pembayaran atau melalui platform digital yang terintegrasi dengan PLN. Pastikan untuk memeriksa tagihan Anda agar pajak listrik tercantum dalam pembayaran tersebut.",
    "Jika Anda ingin membayar pajak listrik, selain melalui PLN, Anda dapat menggunakan berbagai aplikasi pembayaran online yang bekerja sama dengan PLN, atau pergi ke bank yang menerima pembayaran pajak dan tagihan listrik.",
    "Untuk membayar pajak listrik secara online, Anda bisa menggunakan aplikasi seperti PLN Mobile, atau aplikasi pembayaran lainnya yang terhubung dengan PLN. Pastikan untuk memeriksa tagihan listrik Anda agar pajak dapat dibayarkan dengan tepat.",
    "PLN tidak langsung menerima pembayaran pajak listrik, tetapi pembayaran pajak ini biasanya tercantum dalam tagihan listrik bulanan Anda dan dapat dibayar melalui bank, aplikasi pembayaran online, atau layanan pembayaran lainnya yang bekerja sama dengan PLN.",
    "Pembayaran pajak listrik biasanya tidak dikenakan biaya tambahan, karena pajak ini sudah termasuk dalam tagihan listrik bulanan Anda. Namun, pastikan untuk memeriksa rincian tagihan Anda agar Anda tahu total biaya yang harus dibayar.",
    "Jika Anda ingin membayar pajak listrik melalui aplikasi, Anda dapat menggunakan PLN Mobile atau aplikasi pembayaran online yang mendukung pembayaran tagihan listrik, termasuk pajak. Pastikan aplikasi tersebut terhubung dengan layanan PLN untuk pembayaran yang tepat.",
    "Untuk mengetahui apakah Anda harus membayar pajak listrik, periksa rincian tagihan listrik Anda setiap bulannya. Pajak ini biasanya tertera bersamaan dengan biaya penggunaan listrik dan dapat dibayar melalui berbagai saluran pembayaran yang tersedia.",
    "Pembayaran pajak listrik biasanya sudah termasuk dalam tagihan listrik bulanan Anda. Biaya ini dihitung berdasarkan konsumsi listrik Anda dan harus dibayar bersama tagihan bulanan. Pastikan untuk memeriksa tagihan secara teliti untuk mengetahui total yang harus dibayar."
        ]
      },
      {
        "tag": "tarif_prabayar",
        "patterns": [
          "Apa itu tarif listrik prabayar?",
    "Bagaimana cara menggunakan tarif listrik prabayar?",
    "Apa perbedaan tarif prabayar dan pascabayar?",
    "Bagaimana cara mengisi ulang token listrik prabayar?",
    "Bagaimana cara mengetahui saldo listrik prabayar saya?",
    "Kenapa listrik prabayar saya habis cepat?",
    "Tarif listrik prabayar lebih murah atau lebih mahal?",
    "Apa keuntungan menggunakan tarif listrik prabayar?",
    "Bagaimana cara mengecek penggunaan listrik pada tarif prabayar?",
    "Apakah ada aplikasi untuk cek saldo tarif prabayar?",
    "Apakah tarif prabayar lebih hemat?",
    "Bagaimana cara memilih antara tarif prabayar dan pascabayar?",
    "Berapa biaya per kWh untuk tarif prabayar?",
    "Apa yang terjadi jika saldo listrik prabayar habis?",
    "Bagaimana cara mengatasi masalah listrik prabayar yang tidak bisa diisi?",
    "Dapatkah saya menggunakan meteran prabayar dengan tarif pascabayar?",
    "Tarif prabayar itu lebih hemat atau lebih boros?"
        ],
        "responses": [
          "Tarif listrik prabayar adalah sistem di mana pelanggan membayar terlebih dahulu untuk penggunaan listrik mereka sebelum digunakan. Dengan sistem ini, pelanggan membeli token atau pulsa listrik yang kemudian diinput ke meteran listrik prabayar. Setelah saldo habis, listrik akan terputus dan Anda harus mengisi ulang untuk menghidupkannya kembali.",
    "Untuk menggunakan tarif listrik prabayar, Anda perlu membeli pulsa listrik melalui berbagai saluran seperti ATM, aplikasi pembayaran online, atau toko yang menyediakan layanan pembelian pulsa listrik. Setelah itu, masukkan kode token yang didapatkan ke meteran listrik prabayar Anda untuk mengisi saldo listrik.",
    "Perbedaan utama antara tarif prabayar dan pascabayar terletak pada cara pembayaran. Pada tarif prabayar, Anda membayar terlebih dahulu untuk penggunaan listrik, sedangkan pada tarif pascabayar, Anda membayar setelah menggunakan listrik selama sebulan. Dengan prabayar, Anda dapat lebih mudah mengontrol pengeluaran listrik.",
    "Untuk mengisi ulang token listrik prabayar, Anda bisa melakukannya melalui berbagai saluran pembayaran seperti ATM, aplikasi pembayaran online, atau layanan penyedia pulsa listrik. Setelah membeli token, masukkan kode token yang diperoleh ke meteran listrik prabayar untuk mengisi saldo.",
    "Untuk mengetahui saldo listrik prabayar, Anda dapat memeriksa indikator yang ada pada meteran listrik Anda. Beberapa meteran prabayar juga memiliki layar digital yang menampilkan sisa saldo atau jumlah energi yang tersisa. Anda juga bisa mengecek saldo lewat aplikasi PLN Mobile jika meteran Anda terhubung.",
    "Jika listrik prabayar Anda habis dengan cepat, kemungkinan besar konsumsi listrik Anda meningkat atau ada perangkat listrik yang digunakan lebih sering dari biasanya. Anda dapat memeriksa penggunaan listrik secara lebih rinci melalui aplikasi PLN Mobile atau dengan mengecek meteran listrik Anda secara langsung.",
    "Tarif listrik prabayar dan pascabayar biasanya memiliki tarif dasar yang sama, namun prabayar memungkinkan Anda untuk mengontrol penggunaan listrik dengan lebih baik, karena Anda membayar berdasarkan penggunaan yang Anda pilih. Sering kali, pelanggan merasa lebih hemat dengan sistem prabayar karena mereka bisa mengatur konsumsi sesuai kebutuhan.",
    "Keuntungan utama menggunakan tarif listrik prabayar adalah Anda bisa mengontrol penggunaan listrik dengan lebih baik. Anda hanya membayar sesuai dengan jumlah penggunaan yang Anda inginkan, dan tidak ada tagihan kejutan di akhir bulan. Anda juga tidak perlu khawatir tentang pembayaran tertunda karena semuanya sudah dibayar di muka.",
    "Untuk mengecek penggunaan listrik pada tarif prabayar, Anda bisa melihat pembacaan meteran secara langsung atau menggunakan aplikasi PLN Mobile yang menyediakan informasi detail penggunaan listrik Anda. Dengan aplikasi ini, Anda dapat memantau konsumsi listrik dan memastikan saldo cukup untuk melanjutkan penggunaan.",
    "Ya, aplikasi PLN Mobile dapat digunakan untuk mengecek saldo listrik prabayar, riwayat pengisian token, dan sisa saldo yang tersedia. Aplikasi ini juga memungkinkan Anda untuk membeli token listrik secara langsung tanpa perlu keluar rumah.",
    "Tarif listrik prabayar sering dianggap lebih hemat karena Anda dapat mengatur sendiri penggunaan listrik dan menghindari tagihan besar di akhir bulan. Namun, jika konsumsi listrik tidak dipantau dengan baik, Anda mungkin akan kehabisan saldo lebih cepat.",
    "Untuk memilih antara tarif prabayar dan pascabayar, pertimbangkan gaya hidup Anda. Jika Anda lebih suka kontrol langsung atas penggunaan dan pembayaran listrik, tarif prabayar bisa lebih sesuai. Namun, jika Anda lebih suka pembayaran teratur setiap bulan tanpa harus khawatir kehabisan saldo, tarif pascabayar bisa menjadi pilihan.",
    "Biaya per kWh untuk tarif prabayar umumnya sama dengan tarif pascabayar, namun Anda membayar di muka untuk penggunaan listrik. Pastikan untuk memeriksa tarif yang berlaku di wilayah Anda agar bisa menghitung perkiraan penggunaan listrik.",
    "Jika saldo listrik prabayar Anda habis, maka aliran listrik akan terputus. Anda harus mengisi ulang token listrik untuk menghidupkan kembali aliran listrik. Pastikan untuk mengisi ulang sebelum saldo habis agar listrik tetap berfungsi.",
    "Jika meteran listrik prabayar Anda tidak dapat diisi ulang, pastikan token yang dimasukkan benar dan tidak kadaluwarsa. Jika masalah masih berlanjut, hubungi layanan pelanggan PLN untuk mendapatkan bantuan lebih lanjut mengenai pemecahan masalah meteran listrik.",
    "Meteran prabayar hanya dapat digunakan dengan tarif prabayar. Jika Anda ingin beralih ke tarif pascabayar, Anda perlu mengajukan permohonan ke PLN dan mengganti meteran prabayar dengan meteran pascabayar sesuai dengan ketentuan yang berlaku.",
    "Tarif listrik prabayar tidak dapat dianggap lebih hemat atau lebih boros secara umum, karena semua tergantung pada seberapa efisien Anda mengelola penggunaan listrik. Dengan prabayar, Anda bisa mengontrol penggunaan listrik dan menghindari pemborosan, namun jika tidak hati-hati, saldo bisa cepat habis."
        ]
      },
      {
        "tag": "pembatalan_sambungan",
        "patterns": [
          "Bagaimana cara membatalkan sambungan listrik?",
    "Prosedur pembatalan sambungan listrik seperti apa?",
    "Apa yang harus dilakukan untuk membatalkan sambungan listrik?",
    "Bagaimana cara menghentikan pasokan listrik ke rumah?",
    "Apakah ada cara untuk menonaktifkan sambungan listrik?",
    "Bagaimana cara mengajukan permohonan pembatalan sambungan listrik?",
    "Apa saja persyaratan untuk membatalkan sambungan listrik?",
    "Kapan saya bisa membatalkan sambungan listrik?",
    "Jika saya ingin pindah rumah, bagaimana cara membatalkan sambungan listrik?",
    "Apakah ada biaya untuk pembatalan sambungan listrik?",
    "Bagaimana cara menghubungi PLN untuk pembatalan sambungan listrik?",
    "Apa yang terjadi setelah sambungan listrik dibatalkan?",
    "Apakah saya bisa membatalkan sambungan listrik secara online?",
    "Apa saja langkah-langkah untuk mematikan sambungan listrik?",
    "Saya ingin membatalkan sambungan listrik, bagaimana caranya?",
    "Berapa lama proses pembatalan sambungan listrik?",
    "Apa yang harus dipersiapkan sebelum membatalkan sambungan listrik?"
        ],
        "responses": [
          "Untuk membatalkan sambungan listrik, Anda perlu mengajukan permohonan pembatalan kepada PLN. Anda bisa melakukannya dengan mengunjungi kantor PLN terdekat atau melalui saluran komunikasi resmi seperti aplikasi PLN Mobile, atau menghubungi call center PLN.",
        "Prosedur pembatalan sambungan listrik biasanya melibatkan beberapa langkah, mulai dari pengajuan permohonan, verifikasi identitas, hingga penutupan sambungan. Anda juga perlu melunasi tagihan listrik yang masih ada sebelum proses pembatalan dilakukan.",
        "Untuk membatalkan sambungan listrik, Anda harus menghubungi PLN melalui kantor cabang terdekat atau melalui saluran layanan pelanggan yang tersedia. Pastikan Anda membawa dokumen yang diperlukan, seperti KTP dan nomor pelanggan, untuk mempercepat proses pembatalan.",
        "Jika Anda ingin menghentikan pasokan listrik, Anda perlu mengajukan permohonan ke PLN dan memberikan informasi terkait alamat serta nomor pelanggan. Pastikan untuk menyelesaikan tagihan listrik yang belum dibayar sebelum sambungan listrik bisa dibatalkan.",
        "Ada beberapa cara untuk membatalkan sambungan listrik, yaitu melalui aplikasi PLN Mobile, layanan telepon, atau dengan langsung datang ke kantor PLN. Anda juga harus memastikan bahwa semua kewajiban pembayaran telah diselesaikan.",
        "Pembatalan sambungan listrik dapat dilakukan baik secara langsung di kantor PLN maupun melalui permohonan online di aplikasi PLN Mobile. Anda akan diminta untuk mengisi formulir pembatalan dan menyerahkan dokumen pendukung.",
        "Sebelum membatalkan sambungan listrik, pastikan Anda sudah mempersiapkan dokumen yang diperlukan, seperti KTP, nomor pelanggan, dan tagihan terakhir. Anda juga perlu mengonfirmasi bahwa tidak ada tunggakan tagihan yang belum dibayar.",
        "Proses pembatalan sambungan listrik dapat memakan waktu beberapa hari kerja setelah permohonan diajukan. Biasanya, petugas dari PLN akan melakukan pemeriksaan untuk memastikan bahwa semua prosedur telah dipenuhi sebelum sambungan diputus.",
        "Jika Anda ingin membatalkan sambungan listrik karena pindah rumah, Anda dapat mengajukan permohonan pembatalan di kantor PLN terdekat. Jangan lupa untuk melunasi tagihan dan mengonfirmasi bahwa tidak ada perangkat yang tertinggal di rumah yang lama.",
        "Biasanya, PLN tidak mengenakan biaya untuk pembatalan sambungan listrik, namun Anda harus melunasi semua tagihan yang tertunda sebelum sambungan dapat dihentikan. Pastikan tidak ada tunggakan yang harus diselesaikan terlebih dahulu.",
        "Untuk membatalkan sambungan listrik, Anda bisa menghubungi PLN melalui layanan pelanggan di nomor telepon yang tersedia atau mengunjungi kantor PLN terdekat. Anda juga bisa menggunakan aplikasi PLN Mobile untuk pengajuan permohonan secara online.",
        "Setelah sambungan listrik dibatalkan, pasokan listrik di alamat Anda akan dihentikan. Pastikan untuk memeriksa bahwa semua perangkat listrik sudah diputuskan sebelum proses pembatalan dilakukan.",
        "PLN menyediakan berbagai saluran untuk pembatalan sambungan listrik, termasuk aplikasi PLN Mobile dan call center. Jika Anda memilih untuk membatalkan secara online, pastikan semua informasi yang dibutuhkan sudah lengkap untuk mempermudah proses.",
        "Pembatalan sambungan listrik dapat dilakukan dalam beberapa langkah, mulai dari pengajuan permohonan hingga pemeriksaan terakhir. Pastikan Anda telah melunasi semua tagihan sebelum pengajuan, karena pembatalan akan diproses setelah pembayaran selesai.",
        "Sebelum membatalkan sambungan listrik, pastikan Anda memiliki nomor pelanggan dan dokumen identitas yang diperlukan. Hal ini akan membantu mempercepat proses pengajuan pembatalan dan memastikan kelancaran proses administrasi."
        ]
      },
      {
        "tag": "kompensasi_listrik",
        "patterns": [
         "Apakah ada kompensasi untuk gangguan listrik?",
    "Bagaimana cara mendapatkan kompensasi untuk pemadaman listrik?",
    "Jika terjadi pemadaman listrik, apakah PLN memberikan kompensasi?",
    "Bagaimana cara klaim kompensasi untuk gangguan listrik?",
    "Apakah PLN memberikan kompensasi jika listrik mati?",
    "Kompensasi listrik untuk pelanggan seperti apa?",
    "Apakah saya berhak mendapat kompensasi jika ada pemadaman?",
    "Bagaimana prosedur untuk mendapatkan kompensasi listrik?",
    "Jika pemadaman listrik terjadi lebih dari 3 jam, apakah ada kompensasi?",
    "Bagaimana cara melapor untuk mendapatkan kompensasi gangguan listrik?",
    "Apa yang perlu dilakukan jika saya ingin klaim kompensasi gangguan listrik?",
    "PLN memberikan kompensasi atau tidak saat pemadaman?",
    "Bagaimana cara mengecek apakah saya bisa mendapatkan kompensasi listrik?",
    "Jika listrik padam lebih lama, apakah ada kompensasi atau pengembalian biaya?",
    "Kompensasi listrik PLN itu seperti apa dan bagaimana cara mendapatkannya?",
    "Jika ada pemadaman lama, apakah saya bisa mendapatkan pengurangan tagihan listrik?",
    "Apakah PLN memberikan kompensasi untuk gangguan listrik yang lama?",
    "Kompensasi untuk gangguan listrik bisa diterima dalam bentuk apa?"
        ],
        "responses": [
            "Ya, PLN memberikan kompensasi untuk gangguan listrik yang mempengaruhi pelanggan. Kompensasi ini biasanya diberikan dalam bentuk pengurangan tagihan listrik atau pengembalian biaya jika pemadaman berlangsung lebih dari batas waktu tertentu.",
                "Untuk mendapatkan kompensasi akibat gangguan listrik, Anda perlu melapor ke PLN. Anda dapat melaporkan gangguan melalui aplikasi PLN Mobile, call center PLN, atau langsung mengunjungi kantor PLN terdekat. Setelah pelaporan, PLN akan memverifikasi durasi dan penyebab pemadaman, dan jika memenuhi syarat, kompensasi akan diberikan.",
                     "Jika terjadi pemadaman listrik yang berlangsung lebih dari 1 jam, Anda mungkin berhak mendapatkan kompensasi. Anda bisa mengajukan permohonan kompensasi kepada PLN dengan menghubungi layanan pelanggan PLN dan memberikan informasi terkait pemadaman.",
                      "Kompensasi untuk gangguan listrik diberikan berdasarkan ketentuan yang berlaku. Biasanya, pemadaman yang berlangsung lebih dari beberapa jam atau gangguan yang mempengaruhi banyak pelanggan dapat memenuhi syarat untuk kompensasi. Anda bisa memeriksa kebijakan PLN atau menghubungi layanan pelanggan untuk informasi lebih lanjut.",
                        "Jika terjadi pemadaman listrik yang cukup lama, PLN dapat memberikan kompensasi berupa pengurangan tagihan pada bulan berikutnya. Biasanya, kompensasi diberikan jika gangguan listrik lebih dari 3 jam dan mempengaruhi wilayah yang luas.",
                        "Untuk mengklaim kompensasi, Anda perlu melapor ke PLN dan menyebutkan tanggal serta durasi pemadaman listrik yang Anda alami. Jika pemadaman tersebut memenuhi kriteria, PLN akan memproses klaim Anda dan memberikan kompensasi yang sesuai.",
                        "Pemadaman listrik yang berlangsung lebih lama dari waktu tertentu, biasanya 3 jam atau lebih, dapat memicu pemberian kompensasi. Pengembalian biaya atau pengurangan tagihan listrik akan dipertimbangkan setelah verifikasi gangguan dilakukan oleh PLN.",
                        "Apabila Anda ingin klaim kompensasi, pastikan untuk melapor kepada PLN sesegera mungkin. Anda bisa menggunakan aplikasi PLN Mobile atau menelepon layanan pelanggan. Setelah melaporkan pemadaman, PLN akan mengevaluasi klaim Anda dan memberikan kompensasi jika memenuhi syarat.",
                        "PLN memberikan kompensasi apabila pemadaman listrik terjadi dalam waktu yang lama, biasanya lebih dari 3 jam. Kompensasi ini bisa berupa pengurangan tagihan listrik atau pengembalian sebagian biaya yang telah dibayarkan. Prosedur klaim dapat dilakukan melalui aplikasi PLN Mobile atau melalui pengajuan langsung.",
                        "Jika Anda mengalami gangguan listrik, kompensasi biasanya dihitung berdasarkan durasi pemadaman dan jumlah pelanggan yang terpengaruh. Anda dapat mengajukan klaim kompensasi dengan memberikan informasi yang jelas mengenai gangguan tersebut kepada PLN.",
                        "Jika ada pemadaman lebih dari batas waktu yang ditentukan oleh PLN, Anda dapat mengajukan kompensasi. Biasanya, kompensasi berupa pengurangan tagihan akan diterima setelah laporan Anda diproses oleh PLN.",
                        "Kompensasi yang diberikan PLN biasanya berupa pengurangan biaya atau pengembalian sebagian biaya listrik yang telah dibayar. Prosedur klaim dilakukan dengan mengajukan permohonan ke PLN dan memberikan informasi terkait pemadaman atau gangguan.",
                        "Untuk mengetahui apakah Anda berhak atas kompensasi, Anda perlu memeriksa durasi pemadaman yang terjadi. Pemadaman yang lebih dari 3 jam sering kali memenuhi syarat untuk mendapatkan kompensasi. Anda bisa menghubungi PLN untuk mengecek apakah Anda berhak mendapatkan kompensasi.",
                        "Jika Anda merasa berhak atas kompensasi untuk gangguan listrik yang terjadi lama, pastikan untuk mengajukan laporan ke PLN dengan informasi yang lengkap. PLN akan memproses permohonan Anda dan memberikan kompensasi jika memenuhi syarat.",
                        "Kompensasi dapat diterima dalam bentuk pengurangan tagihan atau pengembalian sebagian biaya untuk periode yang terdampak gangguan listrik. Namun, hal ini tergantung pada kebijakan PLN dan durasi pemadaman yang terjadi.",
                        "Jika pemadaman berlangsung lebih dari beberapa jam, PLN memberikan kompensasi berupa pengurangan tagihan. Proses pengajuan kompensasi dapat dilakukan melalui aplikasi PLN Mobile atau dengan menghubungi layanan pelanggan untuk memberikan laporan dan informasi yang diperlukan."
        ]
      },
      {
        "tag": "penghentian_listrik",
        "patterns": [
          "Bagaimana cara menghentikan layanan listrik sementara?",
    "Apa yang harus dilakukan untuk menghentikan listrik sementara?",
    "Bagaimana prosedur untuk menghentikan aliran listrik sementara?",
    "Apakah saya bisa menghentikan listrik sementara tanpa mematikan meteran?",
    "Cara menghentikan pasokan listrik sementara di rumah bagaimana?",
    "Apakah ada cara untuk menghentikan sambungan listrik sementara tanpa pemutusan permanen?",
    "Saya ingin menghentikan layanan listrik sementara, bagaimana cara melakukannya?",
    "Listrik di rumah saya ingin dihentikan sementara, apa prosedurnya?",
    "Apakah ada biaya untuk menghentikan layanan listrik sementara?",
    "Bagaimana cara menonaktifkan pasokan listrik sementara tanpa harus melakukan pemutusan?",
    "Apakah saya bisa menghentikan sambungan listrik sementara dan melanjutkannya nanti?",
    "Bolehkan saya menghentikan listrik sementara tanpa kehilangan sambungan?",
    "Jika saya ingin listrik saya dihentikan sementara, apa yang harus saya lakukan?",
    "Bagaimana cara menghentikan pasokan listrik untuk renovasi rumah?",
    "Prosedur penghentian listrik sementara seperti apa jika saya tidak akan tinggal sementara?"
        ],
        "responses": [
         "Untuk menghentikan layanan listrik sementara, Anda perlu mengajukan permohonan penghentian ke PLN. Anda dapat menghubungi layanan pelanggan PLN melalui aplikasi PLN Mobile, call center, atau langsung ke kantor PLN terdekat. Jika permohonan disetujui, PLN akan menghentikan sambungan listrik sementara sesuai dengan kebutuhan Anda.",
        "Jika Anda ingin menghentikan layanan listrik sementara, langkah pertama adalah mengajukan permohonan penghentian sementara kepada PLN. Hal ini biasanya dilakukan jika Anda akan melakukan renovasi atau tidak akan tinggal di rumah dalam waktu lama. Anda bisa melakukannya melalui aplikasi PLN Mobile, panggilan ke call center, atau datang langsung ke kantor PLN.",
        "Prosedur untuk menghentikan aliran listrik sementara melibatkan pengajuan permohonan kepada PLN. Biasanya, PLN akan memverifikasi permohonan Anda dan menjadwalkan penghentian sambungan listrik sesuai dengan waktu yang disepakati.",
        "PLN memberikan opsi untuk menghentikan pasokan listrik sementara tanpa mematikan meteran. Anda hanya perlu mengajukan permohonan penghentian sementara melalui saluran yang tersedia seperti aplikasi PLN Mobile atau langsung menghubungi call center PLN. Setelah proses selesai, listrik Anda akan dihentikan sementara tanpa pengaruh pada sambungan listrik permanen.",
        "Jika Anda ingin menghentikan pasokan listrik sementara di rumah, Anda harus menghubungi PLN terlebih dahulu. Biasanya, ini dilakukan jika Anda akan meninggalkan rumah untuk jangka waktu lama atau sedang melakukan renovasi. Anda dapat mengajukan permohonan penghentian listrik sementara melalui aplikasi PLN Mobile atau menghubungi PLN langsung.",
        "Untuk menghentikan sambungan listrik sementara tanpa pemutusan permanen, Anda perlu meminta penghentian sementara pada PLN. Prosedur ini akan memungkinkan Anda untuk menghentikan aliran listrik, tetapi sambungan tetap terdaftar. Jika Anda ingin mengaktifkan kembali pasokan listrik, Anda cukup menghubungi PLN.",
        "Jika Anda ingin menghentikan layanan listrik sementara, Anda perlu mengajukan permohonan kepada PLN dengan memberikan informasi mengenai waktu penghentian yang diinginkan. Anda bisa melakukannya melalui aplikasi PLN Mobile atau dengan menghubungi call center PLN untuk instruksi lebih lanjut.",
        "Jika Anda tidak akan tinggal di rumah untuk beberapa waktu dan ingin menghentikan layanan listrik sementara, Anda harus mengajukan permohonan penghentian listrik sementara ke PLN. Biasanya, Anda dapat mengajukan permohonan ini melalui aplikasi PLN Mobile atau langsung menghubungi kantor PLN setempat.",
        "Biaya untuk menghentikan layanan listrik sementara biasanya tidak dikenakan biaya tambahan, namun Anda tetap harus mematuhi prosedur yang berlaku dan memberikan informasi terkait alasan penghentian sementara. Pastikan untuk mengonfirmasi hal ini dengan PLN saat Anda mengajukan permohonan.",
        "Untuk menonaktifkan pasokan listrik sementara tanpa melakukan pemutusan permanen, Anda dapat meminta penghentian sementara. Proses ini memungkinkan Anda untuk mengalihkan aliran listrik sementara tanpa mempengaruhi sambungan listrik Anda, dan Anda dapat mengaktifkannya kembali setelahnya.",
        "PLN memungkinkan penghentian sambungan listrik sementara tanpa kehilangan sambungan. Anda hanya perlu mengajukan permohonan penghentian sementara, dan setelah selesai, Anda dapat menghubungi PLN untuk mengaktifkan kembali pasokan listrik.",
        "Jika Anda ingin listrik Anda dihentikan sementara, Anda perlu mengajukan permohonan penghentian melalui PLN. Hal ini biasanya diperlukan jika Anda sedang tidak berada di rumah atau sedang melakukan perbaikan besar. Anda dapat melakukannya melalui aplikasi PLN Mobile atau menghubungi PLN melalui saluran layanan pelanggan.",
        "Jika Anda sedang melakukan renovasi atau membutuhkan penghentian listrik sementara, Anda bisa mengajukan permohonan penghentian layanan listrik sementara ke PLN. Pastikan untuk memberitahu PLN mengenai tanggal dan durasi penghentian listrik yang diinginkan.",
        "Prosedur penghentian listrik sementara adalah dengan mengajukan permohonan ke PLN, baik melalui aplikasi PLN Mobile atau menghubungi layanan pelanggan PLN. Setelah permohonan disetujui, PLN akan menghentikan sambungan listrik untuk sementara waktu, dan Anda dapat mengaktifkannya kembali sesuai kebutuhan."
        ]
      },
      {
        "tag": "pemeliharaan_listrik",
        "patterns": [
          "Apakah ada pemeliharaan jaringan listrik?",
    "Kapan pemeliharaan listrik dilakukan?",
    "Bagaimana jadwal pemeliharaan jaringan listrik?",
    "Apa yang dimaksud dengan pemeliharaan jaringan listrik?",
    "Kenapa listrik sering mati saat pemeliharaan?",
    "Bagaimana cara mengetahui jadwal pemeliharaan listrik?",
    "Apakah pemeliharaan listrik mempengaruhi pasokan listrik?",
    "Apa yang harus dilakukan pelanggan saat ada pemeliharaan listrik?",
    "Apa dampak pemeliharaan jaringan listrik terhadap pengguna?",
    "Kapan pemeliharaan rutin jaringan listrik dilakukan?",
    "Apakah pemeliharaan listrik dilakukan secara terjadwal?",
    "Apa yang harus saya ketahui tentang pemeliharaan listrik?",
    "Bagaimana cara PLN menginformasikan pemeliharaan listrik?",
    "Apakah pemeliharaan listrik bisa menyebabkan gangguan?",
    "Bagaimana cara menghindari gangguan listrik saat pemeliharaan?",
    "Kapan waktu terbaik untuk melakukan pemeliharaan jaringan listrik?"
        ],
        "responses": [
            "Pemeliharaan jaringan listrik biasanya dilakukan secara terjadwal oleh PLN untuk memastikan kualitas dan keandalan pasokan listrik. Proses ini termasuk perawatan rutin dan perbaikan jaringan yang dapat mempengaruhi aliran listrik di beberapa wilayah.",
        "Pemeliharaan listrik sering dilakukan untuk memastikan bahwa jaringan listrik berfungsi dengan baik. PLN mengatur pemeliharaan secara berkala untuk meminimalisir gangguan pada pasokan listrik dan meningkatkan keselamatan sistem kelistrikan.",
        "Pemeliharaan jaringan listrik biasanya dilakukan pada waktu tertentu yang sudah direncanakan sebelumnya. Biasanya, PLN akan memberikan informasi mengenai pemeliharaan melalui pemberitahuan di area terdampak atau melalui saluran komunikasi lainnya, seperti aplikasi PLN Mobile atau situs web PLN.",
        "Pemeliharaan rutin jaringan listrik dilakukan untuk memastikan sistem kelistrikan tetap aman dan efisien. Kegiatan ini dapat mencakup pemeriksaan dan perbaikan peralatan listrik serta penggantian komponen yang sudah usang.",
        "Pemeliharaan listrik bisa menyebabkan gangguan sementara pada pasokan listrik di area yang terpengaruh. Untuk menghindari gangguan yang lebih lama, PLN biasanya akan melakukan pemeliharaan pada waktu yang tepat dan memberitahukan masyarakat terlebih dahulu.",
        "PLN biasanya menginformasikan jadwal pemeliharaan listrik melalui pemberitahuan langsung kepada pelanggan di area yang terkena dampak. Anda juga dapat memeriksa jadwal pemeliharaan di aplikasi PLN Mobile atau melalui situs web PLN.",
        "Pemeliharaan jaringan listrik sering kali dilakukan pada malam hari atau di luar jam sibuk untuk meminimalisir gangguan terhadap konsumen. Namun, hal ini tergantung pada kondisi dan kebutuhan perawatan masing-masing wilayah.",
        "Jika ada pemeliharaan listrik di area Anda, biasanya ada pemberitahuan sebelumnya. Untuk mengantisipasi gangguan, Anda disarankan untuk mematikan perangkat listrik yang tidak digunakan dan memastikan rumah atau tempat usaha Anda siap jika terjadi pemutusan sementara.",
        "Dampak pemeliharaan jaringan listrik terhadap pelanggan bisa berupa pemutusan pasokan listrik sementara di area yang sedang diperbaiki. Pemeliharaan dilakukan untuk meningkatkan kualitas pasokan listrik dan mengurangi gangguan yang lebih besar di masa depan.",
        "Pemeliharaan rutin pada jaringan listrik dilakukan sesuai jadwal yang telah disusun oleh PLN. Jadwal tersebut bisa bervariasi tergantung pada kondisi cuaca, kebutuhan perawatan, atau jenis perbaikan yang diperlukan.",
        "Pemeliharaan listrik dilakukan untuk memperbaiki dan merawat jaringan agar tetap berfungsi dengan baik. Anda akan diinformasikan mengenai pemeliharaan ini melalui berbagai saluran, termasuk pesan singkat, pengumuman di aplikasi PLN, atau notifikasi di situs web PLN.",
        "Pemeliharaan jaringan listrik tidak selalu menyebabkan gangguan yang lama. Biasanya, gangguan bersifat sementara dan akan diberitahukan sebelumnya agar pelanggan dapat mempersiapkan diri. Jika ada pemadaman yang lebih lama, PLN akan memberi tahu lebih lanjut tentang penyebab dan perkiraan waktu pemulihan.",
        "Pemeliharaan listrik yang dijadwalkan biasanya diberitahukan melalui pemberitahuan di tempat atau informasi yang disebarkan oleh PLN, seperti melalui SMS, aplikasi PLN Mobile, atau melalui media sosial. Hal ini memungkinkan pelanggan untuk mempersiapkan diri dan mengurangi dampak dari pemadaman listrik sementara."
        ]
      },
      {
        "tag": "tagihan_tunggakan",
        "patterns": [
          "Bagaimana cara melunasi tagihan listrik yang tertunda?",
    "Apa yang harus dilakukan jika tagihan listrik saya menunggak?",
    "Apa akibatnya jika saya tidak membayar tagihan listrik?",
    "Bagaimana cara membayar tagihan listrik yang sudah jatuh tempo?",
    "Apa yang terjadi jika tagihan listrik saya menunggak terlalu lama?",
    "Bagaimana cara melunasi tagihan listrik yang tertunggak di PLN?",
    "Adakah denda jika tagihan listrik menunggak?",
    "Bagaimana cara menghindari pemutusan listrik karena tagihan menunggak?",
    "Bisakah saya cicil tagihan listrik yang menunggak?",
    "Apa yang harus saya lakukan jika saya tidak bisa membayar tagihan listrik?",
    "Tagihan listrik menunggak, bagaimana cara mengatasinya?",
    "Tagihan listrik saya sudah jatuh tempo, apakah ada batas waktu untuk membayar?",
    "Apakah ada bantuan atau program pembayaran untuk tagihan listrik menunggak?",
    "Bagaimana cara mengetahui jumlah tunggakan tagihan listrik saya?",
    "Apakah saya bisa mengajukan keringanan untuk tagihan listrik yang menunggak?",
    "Bagaimana proses pembayaran tagihan listrik yang tertunda?"
        ],
        "responses": [
            "Jika tagihan listrik Anda menunggak, segeralah melunasinya untuk menghindari denda atau pemutusan layanan. Anda dapat membayar tagihan listrik tertunda melalui berbagai metode, seperti melalui ATM, internet banking, aplikasi PLN Mobile, atau di tempat pembayaran resmi PLN.",
                "Jika tagihan listrik Anda menunggak, Anda bisa langsung membayar jumlah yang tertunggak melalui berbagai saluran pembayaran, seperti di ATM, aplikasi PLN Mobile, atau situs web PLN. Pastikan untuk memeriksa jumlah tagihan dan memastikan Anda membayar sesuai dengan total yang tertera.",
                      "Untuk melunasi tagihan listrik yang tertunda, Anda dapat melakukan pembayaran langsung melalui berbagai saluran seperti bank, aplikasi pembayaran online, atau langsung ke kantor PLN. Pastikan untuk membayar sebelum jatuh tempo untuk menghindari gangguan pasokan listrik.",
                        "Jika tagihan listrik Anda menunggak, PLN akan memberikan pemberitahuan terkait pemutusan pasokan listrik jika pembayaran tidak dilakukan dalam jangka waktu tertentu. Sebaiknya segera bayar tunggakan Anda untuk menghindari pemutusan layanan.",
                        "Jika Anda tidak dapat membayar tagihan listrik yang tertunda, segera hubungi layanan pelanggan PLN untuk mencari solusi seperti cicilan atau pengaturan ulang pembayaran. PLN biasanya menawarkan opsi pembayaran atau keringanan bagi pelanggan yang membutuhkan.",
                        "Denda dapat dikenakan jika pembayaran tagihan listrik terlambat. Untuk menghindari denda, pastikan untuk membayar tagihan listrik tepat waktu atau segera setelah Anda menerima pemberitahuan mengenai tagihan yang belum dibayar.",
                        "Jika tagihan listrik Anda sudah jatuh tempo dan belum dibayar, Anda bisa membayar langsung melalui aplikasi PLN Mobile atau bank. Pastikan untuk memeriksa rincian tagihan di aplikasi atau di situs web PLN untuk memastikan jumlah yang harus dibayar.",
                        "Jika tagihan listrik Anda menunggak dan sudah melewati batas waktu pembayaran, aliran listrik akan diputus sementara. Namun, Anda masih bisa melakukan pembayaran untuk mengaktifkan kembali layanan. Sebaiknya lakukan pembayaran sesegera mungkin untuk menghindari gangguan layanan lebih lanjut.",
                        "PLN memberikan beberapa cara untuk melunasi tagihan listrik yang menunggak, termasuk pembayaran melalui transfer bank, aplikasi PLN Mobile, atau pembayaran langsung di kantor PLN. Jika Anda mengalami kesulitan, Anda dapat menghubungi layanan pelanggan PLN untuk mencari solusi yang sesuai.",
                        "Jika Anda mengalami kesulitan dalam membayar tagihan listrik yang menunggak, Anda bisa menghubungi PLN untuk meminta keringanan atau mengatur pembayaran secara cicilan. PLN mungkin menyediakan opsi seperti pembayaran bertahap atau penundaan pembayaran bagi pelanggan yang memenuhi syarat.",
                        "Apabila tagihan listrik Anda sudah menunggak cukup lama dan tidak dapat dilunasi sekaligus, Anda dapat mengajukan permohonan cicilan ke PLN. Beberapa pelanggan mungkin memenuhi syarat untuk cicilan atau pengaturan pembayaran lain tergantung pada kebijakan yang berlaku.",
                        "Jika Anda tidak membayar tagihan listrik Anda dalam waktu yang cukup lama, aliran listrik akan terputus, dan Anda akan dikenakan biaya pemutusan. Untuk menghindari masalah ini, segeralah melunasi tagihan atau ajukan opsi pembayaran kepada PLN.",
                        "Anda bisa menghubungi PLN untuk memeriksa rincian tagihan dan mengetahui jumlah tunggakan Anda. Jika Anda tidak yakin dengan jumlah tagihan yang tertunda, aplikasi PLN Mobile atau layanan pelanggan PLN dapat membantu Anda mendapatkan informasi yang lebih jelas dan rinci.",
                        "Jika tagihan listrik Anda menunggak, Anda dapat mengajukan permohonan untuk keringanan atau pengaturan pembayaran. PLN biasanya memberikan opsi bagi pelanggan yang kesulitan membayar, tergantung pada kondisi masing-masing pelanggan.",
                        "Untuk membayar tagihan listrik yang tertunda, Anda dapat mengecek jumlah tunggakan Anda melalui aplikasi PLN Mobile atau melalui layanan pelanggan PLN. Setelah mengetahui jumlah yang harus dibayar, lakukan pembayaran sesuai instruksi yang tersedia."
        ]
      },
      {
        "tag": "sambungan_ulang",
        "patterns": [
          "Bagaimana cara mengajukan sambungan listrik ulang?",
    "Prosedur untuk mengaktifkan kembali listrik seperti apa?",
    "Apa yang harus dilakukan jika ingin mengajukan sambungan listrik ulang?",
    "Bagaimana cara mengaktifkan kembali sambungan listrik setelah diputus?",
    "Saya ingin mengajukan sambungan listrik ulang, apa langkah-langkahnya?",
    "Apa prosedur untuk menyambung listrik yang sudah diputus?",
    "Bagaimana cara mengajukan permohonan sambungan listrik ulang di PLN?",
    "Apa yang perlu disiapkan untuk mengajukan sambungan ulang listrik?",
    "Bagaimana cara mengaktifkan kembali pasokan listrik yang terputus?",
    "Jika listrik saya diputus, bagaimana cara mengajukan sambungan ulang?",
    "Apakah ada biaya untuk mengajukan sambungan listrik ulang?",
    "Proses sambungan listrik ulang seperti apa di PLN?",
    "Saya baru saja diputus listriknya, bagaimana cara mengajukan sambungan ulang?",
    "Apakah ada syarat untuk melakukan sambungan listrik ulang?",
    "Bagaimana cara memastikan bahwa sambungan listrik saya diaktifkan kembali?"
        ],
        "responses": [
          "Untuk mengajukan sambungan listrik ulang, Anda harus menghubungi PLN terlebih dahulu. Anda bisa melakukannya melalui aplikasi PLN Mobile, call center, atau mengunjungi kantor PLN terdekat. Setelah permohonan Anda diterima, petugas PLN akan melakukan verifikasi dan proses penyambungan ulang.",
        "Prosedur untuk mengaktifkan kembali listrik yang terputus adalah dengan mengajukan permohonan sambungan ulang ke PLN. Anda dapat mengajukan permohonan ini melalui aplikasi PLN Mobile atau menghubungi call center PLN. Setelah proses verifikasi dan pembayaran, petugas PLN akan melakukan sambungan ulang.",
        "Jika listrik Anda terputus dan ingin mengajukan sambungan ulang, langkah pertama adalah menghubungi PLN untuk mengajukan permohonan sambungan listrik ulang. Anda dapat melakukannya melalui aplikasi PLN Mobile atau dengan menghubungi layanan pelanggan. Petugas PLN akan melakukan pemeriksaan dan mengaktifkan kembali sambungan listrik Anda.",
        "Untuk mengaktifkan kembali sambungan listrik setelah diputus, Anda perlu mengajukan permohonan sambungan ulang kepada PLN. Biasanya, Anda harus membayar biaya tunggakan atau biaya pemutusan sebelumnya sebelum proses penyambungan ulang dilakukan.",
        "Proses untuk mengajukan sambungan listrik ulang dimulai dengan menghubungi PLN untuk memberitahukan bahwa listrik Anda terputus. Anda bisa mengajukan permohonan sambungan ulang melalui aplikasi PLN Mobile atau menghubungi call center PLN. Setelah itu, Anda akan diberikan instruksi lebih lanjut untuk menyelesaikan proses tersebut.",
        "Jika listrik Anda diputus, Anda perlu mengajukan permohonan sambungan ulang melalui PLN. Anda bisa menghubungi PLN melalui aplikasi atau call center. PLN akan memverifikasi kondisi dan jika pembayaran tunggakan atau biaya terkait sudah diselesaikan, sambungan akan segera diaktifkan kembali.",
        "Untuk mengajukan sambungan listrik ulang, Anda perlu memberikan informasi terkait lokasi dan ID pelanggan. PLN akan melakukan verifikasi dan memberi instruksi lebih lanjut. Anda bisa mengajukan permohonan sambungan ulang melalui aplikasi PLN Mobile atau melalui layanan pelanggan PLN.",
        "Syarat untuk melakukan sambungan listrik ulang biasanya meliputi pembayaran tagihan atau biaya pemutusan yang tertunda. Setelah itu, PLN akan memeriksa sistem kelistrikan Anda dan mengaktifkan kembali pasokan listrik Anda.",
        "Jika pasokan listrik Anda terputus, Anda dapat mengajukan permohonan sambungan ulang kepada PLN. Proses ini melibatkan verifikasi pembayaran tunggakan dan proses teknis oleh petugas PLN untuk mengaktifkan kembali listrik Anda.",
        "Jika listrik Anda diputus dan Anda ingin mengajukan sambungan ulang, Anda perlu menghubungi PLN untuk memulai proses tersebut. Anda dapat mengajukan permohonan sambungan ulang melalui aplikasi PLN Mobile atau menghubungi layanan pelanggan PLN untuk mendapatkan petunjuk lebih lanjut.",
        "Biaya untuk mengajukan sambungan listrik ulang tergantung pada kondisi dan alasan pemutusan. Biasanya, Anda perlu membayar biaya tunggakan atau biaya administrasi sebelum sambungan listrik dapat diaktifkan kembali. Pastikan untuk mengonfirmasi biaya ini dengan PLN saat Anda mengajukan permohonan.",
        "Proses sambungan listrik ulang melibatkan beberapa langkah, mulai dari pengajuan permohonan melalui aplikasi PLN Mobile atau layanan pelanggan PLN, pembayaran tunggakan jika ada, hingga proses teknis oleh petugas PLN untuk menghubungkan kembali listrik Anda.",
        "Jika listrik Anda diputus, Anda bisa mengajukan sambungan ulang dengan menghubungi PLN. Setelah permohonan diajukan, PLN akan memeriksa apakah pembayaran sudah diselesaikan dan mengaktifkan kembali pasokan listrik Anda.",
        "Syarat untuk melakukan sambungan listrik ulang umumnya termasuk pembayaran tagihan yang tertunda dan pengajuan permohonan yang valid. PLN akan memproses permohonan sambungan ulang Anda setelah verifikasi selesai.",
        "Untuk memastikan sambungan listrik diaktifkan kembali, Anda harus mengikuti prosedur pengajuan yang berlaku dan memastikan semua persyaratan, seperti pembayaran tunggakan, telah dipenuhi. Setelah itu, PLN akan segera memproses permohonan sambungan ulang."
        ]
      },
      {
        "tag": "program_daya",
        "patterns": [
          "Apakah ada program peningkatan daya listrik?",
    "Bagaimana cara mengajukan peningkatan daya listrik?",
    "Apa saja persyaratan untuk mengajukan peningkatan daya listrik?",
    "Bagaimana prosedur untuk menaikkan daya listrik saya?",
    "Apa yang harus dilakukan jika ingin meningkatkan daya listrik?",
    "Apakah ada biaya untuk peningkatan daya listrik?",
    "Prosedur untuk mengajukan permohonan peningkatan daya listrik seperti apa?",
    "Jika daya listrik saya tidak mencukupi, bagaimana cara mengajukan peningkatan?",
    "Bagaimana cara memperbesar daya listrik rumah saya?",
    "Apa langkah-langkah untuk meningkatkan kapasitas daya listrik?",
    "Bagaimana cara mengajukan permohonan untuk menambah daya listrik?",
    "Jika daya listrik sering trip, bagaimana cara meningkatkan daya listrik?",
    "Apa syarat-syarat untuk pengajuan peningkatan daya listrik?",
    "Berapa lama proses peningkatan daya listrik setelah pengajuan?",
    "Bagaimana cara memperbarui daya listrik untuk kebutuhan yang lebih besar?",
    "Apakah PLN menawarkan program untuk menaikkan daya listrik pelanggan?",
    "Apa keuntungan mengajukan peningkatan daya listrik?",
    "Bagaimana proses pemeriksaan untuk peningkatan daya listrik di PLN?"
        ],
        "responses": [
          "Untuk mengajukan peningkatan daya listrik, Anda perlu menghubungi PLN melalui aplikasi PLN Mobile, call center, atau mengunjungi kantor PLN terdekat. Anda harus mengisi formulir permohonan peningkatan daya dan memenuhi beberapa syarat yang ditetapkan PLN.",
        "Prosedur untuk mengajukan peningkatan daya listrik dimulai dengan menghubungi PLN untuk mendaftar program peningkatan daya. Anda bisa melakukannya melalui aplikasi PLN Mobile atau langsung ke kantor PLN. Setelah itu, PLN akan melakukan pemeriksaan kelayakan dan proses administrasi.",
        "Jika daya listrik Anda tidak mencukupi, Anda bisa mengajukan permohonan untuk peningkatan daya. Pastikan untuk menyiapkan data terkait konsumsi listrik saat ini dan alasan mengapa Anda perlu meningkatkan daya. Proses ini biasanya melibatkan biaya administrasi dan pemeriksaan teknis oleh PLN.",
        "Untuk menaikkan daya listrik, Anda perlu mengajukan permohonan kepada PLN. Anda bisa menghubungi mereka melalui aplikasi PLN Mobile, call center, atau langsung ke kantor PLN. Setelah permohonan disetujui, PLN akan melakukan evaluasi teknis dan pemasangan daya baru.",
        "Jika Anda merasa daya listrik rumah Anda tidak cukup untuk kebutuhan, Anda dapat mengajukan peningkatan daya dengan menghubungi PLN. PLN akan memeriksa apakah penambahan daya diperlukan dan menyesuaikan daya yang dibutuhkan sesuai dengan konsumsi listrik Anda.",
        "Peningkatan daya listrik akan dikenakan biaya administrasi dan biaya terkait instalasi. Biaya ini bervariasi tergantung pada besar daya yang diajukan dan lokasi rumah Anda. PLN akan memberikan estimasi biaya saat Anda mengajukan permohonan.",
        "Untuk mengajukan peningkatan daya listrik, Anda perlu menghubungi PLN untuk meminta formulir permohonan dan memberikan informasi terkait daya listrik yang dibutuhkan. Setelah verifikasi, PLN akan melanjutkan proses teknis untuk meningkatkan daya listrik sesuai permohonan.",
        "Syarat untuk pengajuan peningkatan daya biasanya meliputi pemeriksaan kelayakan teknis dan pembayaran biaya administrasi. Anda perlu menyediakan data terkait penggunaan listrik dan alasan kenaikan daya. PLN juga akan melakukan pemeriksaan fisik untuk memastikan instalasi mendukung daya yang lebih besar.",
        "Setelah pengajuan peningkatan daya, proses verifikasi biasanya memakan waktu beberapa hari hingga minggu tergantung pada lokasi dan kebijakan PLN. Setelah disetujui, PLN akan melakukan instalasi peningkatan daya sesuai dengan standar teknis yang berlaku.",
        "Untuk meningkatkan kapasitas daya listrik, Anda bisa mengajukan permohonan melalui aplikasi PLN Mobile atau call center PLN. PLN akan mengevaluasi permohonan Anda dan melakukan pemeriksaan untuk memastikan pemasangan daya tambahan dapat dilakukan dengan aman.",
        "Keuntungan mengajukan peningkatan daya listrik adalah untuk memenuhi kebutuhan konsumsi listrik yang lebih besar, menghindari pemadaman listrik atau daya yang sering trip. Hal ini penting terutama jika Anda menggunakan banyak perangkat elektronik atau alat berat yang memerlukan daya lebih besar.",
        "PLN menawarkan program peningkatan daya untuk pelanggan yang membutuhkan kapasitas listrik lebih besar dari yang ada saat ini. Anda bisa mengajukan permohonan untuk peningkatan daya melalui aplikasi PLN Mobile atau dengan menghubungi kantor PLN terdekat. Proses ini termasuk pemeriksaan teknis dan instalasi oleh petugas PLN.",
        "Peningkatan daya listrik dilakukan dengan mengajukan permohonan melalui aplikasi PLN Mobile atau dengan datang langsung ke kantor PLN. Setelah pengajuan diterima, PLN akan melakukan pengecekan teknis dan memberikan estimasi biaya serta waktu yang dibutuhkan untuk instalasi.",
        "Jika daya listrik Anda sering trip karena penggunaan alat berat, Anda bisa mengajukan peningkatan daya dengan menghubungi PLN. Petugas PLN akan memeriksa kondisi instalasi listrik Anda dan memberikan saran mengenai jenis peningkatan daya yang dibutuhkan.",
        "PLN akan mengevaluasi permohonan peningkatan daya berdasarkan kapasitas teknis yang ada dan kebutuhan Anda. Jika permohonan disetujui, PLN akan melanjutkan dengan proses pemasangan daya baru sesuai permintaan Anda. Anda bisa memantau proses ini melalui aplikasi PLN Mobile."
        ]
    },
      {
        "tag": "siapa_penciptamu",
        "patterns": [
          "Siapa penciptamu?",
    "Siapa yang membuatmu?",
    "Apa yang menciptakanmu?",
    "Dari siapa kamu dibuat?",
    "Siapa yang merancangmu?",
    "Siapa yang membuat kamu ada?",
    "Apa yang menciptakan dirimu?",
    "Siapa yang mengembangkanmu?",
    "Siapa yang membuat AI seperti kamu?",
    "Siapa yang menciptakan kecerdasan buatan sepertimu?",
    "Bagaimana cara kamu dibuat?",
    "Siapa pengembang dari kecerdasan buatan ini?",
    "Apa yang membuatmu bisa berbicara seperti ini?",
    "Siapa yang merancang kecerdasan buatan yang kamu miliki?",
    "Dari mana asalmu?"
        ],
        "responses": [
          "Saya adalah hasil pengembangan oleh Afandi, seorang mahasiswa di program studi MTI UNISBANK Semarang, yang memiliki ketertarikan mendalam dalam riset kecerdasan buatan. Afandi berfokus untuk mengembangkan AI yang dapat memahami dan merespons percakapan manusia secara alami.",
    "Saya diciptakan oleh Afandi, seorang mahasiswa MTI UNISBANK Semarang, yang mengkhususkan diri dalam bidang kecerdasan buatan. Dengan menggabungkan teori dan praktek dalam pengembangan teknologi AI, Afandi bertujuan menciptakan sistem yang dapat membantu memecahkan berbagai masalah sehari-hari melalui interaksi yang lebih mudah dan efisien.",
    "Saya adalah kecerdasan buatan yang dikembangkan oleh Afandi, seorang mahasiswa dari MTI UNISBANK Semarang, yang tertarik pada penerapan kecerdasan buatan dalam kehidupan sehari-hari. Pengembangan saya berfokus pada kemampuan untuk berkomunikasi dan memahami bahasa manusia.",
    "Saya adalah karya hasil penelitian Afandi, mahasiswa MTI UNISBANK Semarang, yang fokus pada riset kecerdasan buatan untuk membangun sistem interaktif yang dapat memudahkan komunikasi antara manusia dan teknologi.",
    "Afandi, seorang mahasiswa di MTI UNISBANK Semarang, mengembangkan saya dengan tujuan menciptakan kecerdasan buatan yang mampu memberikan solusi interaktif untuk beragam keperluan, baik dalam pendidikan, pekerjaan, maupun kehidupan sehari-hari. Penelitian ini berfokus pada pemahaman bahasa dan interaksi yang lebih manusiawi.",
    "Saya dikembangkan oleh Afandi, seorang mahasiswa MTI UNISBANK Semarang, yang memiliki visi untuk menjadikan kecerdasan buatan lebih mudah diakses dan digunakan oleh masyarakat. Afandi berusaha menciptakan sistem AI yang dapat mempermudah interaksi antara manusia dan mesin.",
    "Afandi, seorang mahasiswa dari MTI UNISBANK Semarang, mengembangkan saya dengan memanfaatkan keahlian dalam bidang kecerdasan buatan. Fokus utamanya adalah menciptakan teknologi yang dapat berkomunikasi dan membantu pengguna dalam menjawab pertanyaan serta memberikan informasi yang relevan."
      ]
      
    },
    {
      "tag": "energi_terbarukan",
      "patterns": [
        "Apa itu energi terbarukan?",
  "Apa yang dimaksud dengan energi terbarukan?",
  "Apa contoh energi terbarukan?",
  "Bagaimana cara kerja energi terbarukan?",
  "Bagaimana PLN mendukung energi terbarukan?",
  "Apakah PLN memiliki program energi terbarukan?",
  "Apakah PLN menggunakan energi terbarukan?",
  "Apakah listrik PLN berasal dari energi terbarukan?",
  "Program energi terbarukan apa yang dimiliki PLN?",
  "Bagaimana cara PLN mengimplementasikan energi terbarukan?",
  "Apa manfaat energi terbarukan?",
  "Apakah energi terbarukan bisa menggantikan energi fosil?",
  "Apakah pelanggan bisa menggunakan energi terbarukan dari PLN?"
      ],
      "responses": [
        "Energi terbarukan adalah energi yang berasal dari sumber-sumber alam yang dapat diperbarui secara alami, seperti matahari, angin, air, dan biomassa.",
  "PLN mendukung energi terbarukan melalui berbagai program, seperti pembangkit listrik tenaga surya, angin, dan mikrohidro.",
  "Ya, PLN telah mulai memanfaatkan energi terbarukan dalam beberapa pembangkit listriknya untuk mendukung penggunaan energi yang lebih ramah lingkungan.",
  "Program energi terbarukan PLN termasuk pengembangan pembangkit listrik tenaga surya, pembangkit listrik tenaga angin, dan pembangkit listrik tenaga air di berbagai wilayah di Indonesia.",
  "Manfaat energi terbarukan meliputi pengurangan emisi gas rumah kaca, penghematan sumber daya energi fosil, dan mendukung keberlanjutan lingkungan.",
  "PLN juga bekerja sama dengan pemerintah untuk mendorong penggunaan energi terbarukan melalui regulasi dan insentif bagi pengembang energi terbarukan.",
  "Jika Anda ingin menggunakan energi terbarukan, PLN menyediakan opsi untuk membeli listrik yang dihasilkan dari sumber energi terbarukan, tergantung pada lokasi Anda.",
  "Energi terbarukan membantu mengurangi ketergantungan pada bahan bakar fosil dan menciptakan solusi jangka panjang untuk kebutuhan energi di masa depan.",
  "Melalui PLN Mobile, Anda bisa mendapatkan informasi lebih lanjut tentang program energi terbarukan yang ditawarkan PLN di daerah Anda."
    ]
    },

{
  "tag": "subsidi_listrik",
  "patterns": [
    "Apa itu subsidi listrik?",
  "Bagaimana cara mendapatkan subsidi listrik?",
  "Siapa saja yang berhak menerima subsidi listrik?",
  "Apakah saya bisa mendaftar untuk subsidi listrik?",
  "Bagaimana PLN menentukan penerima subsidi listrik?",
  "Subsidi listrik diberikan untuk siapa saja?",
  "Bagaimana cara mengecek apakah saya mendapat subsidi listrik?",
  "Apa syarat untuk mendapatkan subsidi listrik?",
  "Apakah subsidi listrik berlaku untuk semua pelanggan?",
  "Bagaimana prosedur pengajuan subsidi listrik?",
  "Apakah PLN memberikan subsidi untuk rumah tangga?",
  "Apakah pelanggan 450 VA mendapatkan subsidi listrik?",
  "Bagaimana saya tahu jika tagihan saya sudah disubsidi?",
  "Apa perbedaan listrik bersubsidi dan non-subsidi?",
  "Apakah ada aplikasi untuk mengecek subsidi listrik?"
  ],
  "responses": [
    "Subsidi listrik adalah bantuan pemerintah yang diberikan kepada pelanggan tertentu untuk meringankan biaya penggunaan listrik.",
  "Penerima subsidi listrik biasanya adalah rumah tangga dengan daya listrik 450 VA atau 900 VA yang terdaftar sebagai pelanggan tidak mampu.",
  "Untuk mendapatkan subsidi listrik, Anda perlu memenuhi kriteria yang telah ditetapkan oleh pemerintah, seperti terdaftar dalam Data Terpadu Kesejahteraan Sosial (DTKS).",
  "Anda dapat mengecek apakah Anda menerima subsidi listrik melalui aplikasi PLN Mobile atau langsung bertanya ke kantor PLN terdekat.",
  "Subsidi listrik diberikan kepada pelanggan dengan daya tertentu dan status ekonomi yang memenuhi syarat, seperti rumah tangga tidak mampu atau usaha kecil.",
  "Jika Anda merasa berhak mendapatkan subsidi tetapi belum menerimanya, Anda bisa menghubungi PLN untuk verifikasi dan pengajuan lebih lanjut.",
  "Tagihan listrik bersubsidi biasanya lebih murah karena sebagian biaya telah ditanggung oleh pemerintah.",
  "Untuk pelanggan daya 450 VA, subsidi listrik umumnya diberikan secara otomatis, sementara pelanggan 900 VA harus memenuhi syarat tertentu.",
  "Aplikasi PLN Mobile dapat digunakan untuk mengecek status subsidi listrik Anda dan memastikan apakah Anda sudah terdaftar sebagai penerima subsidi.",
  "Jika subsidi listrik Anda dihentikan, Anda bisa mengajukan keberatan ke PLN dengan membawa dokumen pendukung yang menunjukkan bahwa Anda berhak mendapatkannya.",
  "Program subsidi listrik bertujuan untuk membantu masyarakat yang kurang mampu agar tetap dapat menikmati akses listrik dengan biaya yang terjangkau.",
  "Pelanggan yang mendapatkan subsidi biasanya tidak perlu melakukan pendaftaran ulang setiap bulan, tetapi verifikasi data tetap dilakukan oleh pemerintah secara berkala.",
  "Subsidi listrik diberikan untuk memastikan bahwa masyarakat yang membutuhkan tetap memiliki akses terhadap energi listrik dengan harga yang lebih terjangkau."
  ]
},

{
  "tag": "pengaduan_kebocoran_listrik",
  "patterns": [
    "Bagaimana cara melaporkan kebocoran listrik?",
  "Apa yang harus dilakukan jika ada kebocoran listrik?",
  "Kemana melaporkan kebocoran listrik?",
  "Siapa yang harus dihubungi jika terjadi kebocoran listrik?",
  "Bagaimana cara menangani kebocoran listrik?",
  "Apakah PLN menerima laporan kebocoran listrik?",
  "Listrik di rumah saya bocor, apa yang harus saya lakukan?",
  "Apa langkah pertama saat terjadi kebocoran listrik?",
  "Bisakah melaporkan kebocoran listrik melalui PLN Mobile?",
  "Apa nomor pengaduan kebocoran listrik?",
  "Bagaimana prosedur melaporkan kebocoran listrik ke PLN?",
  "Apa yang dimaksud dengan kebocoran listrik dan bagaimana melaporkannya?"
  ],
  "responses": [
    "Jika Anda mencurigai adanya kebocoran listrik, segera matikan aliran listrik melalui MCB (Miniature Circuit Breaker) dan hindari area yang terpengaruh.",
  "Untuk melaporkan kebocoran listrik, Anda dapat menghubungi layanan pelanggan PLN di nomor 123 atau melalui aplikasi PLN Mobile.",
  "Pastikan untuk memberikan informasi detail seperti lokasi kebocoran, jenis kerusakan, dan nomor ID pelanggan saat melaporkan ke PLN.",
  "Kebocoran listrik dapat sangat berbahaya. Jangan mencoba memperbaikinya sendiri jika Anda tidak memiliki keahlian khusus, hubungi teknisi PLN segera.",
  "Anda juga dapat melaporkan kebocoran listrik melalui email resmi PLN atau mendatangi kantor PLN terdekat.",
  "Prosedur pelaporan kebocoran listrik melibatkan menghubungi PLN dengan menjelaskan masalah, memberikan data pelanggan, dan mengikuti petunjuk lebih lanjut dari petugas PLN.",
  "Laporan kebocoran listrik akan segera ditindaklanjuti oleh teknisi PLN untuk memastikan keselamatan Anda dan memulihkan sistem listrik dengan aman.",
  "Jika Anda menggunakan aplikasi PLN Mobile, Anda dapat mengakses menu pengaduan dan memilih kategori kebocoran listrik untuk melaporkannya secara online.",
  "Kebocoran listrik adalah aliran listrik yang tidak terkendali karena kabel atau perangkat yang rusak. Penting untuk melaporkannya segera untuk mencegah bahaya lebih lanjut."
]
},

{
    "tag": "perawatan_meteran_listrik",
    "patterns": [
      "Bagaimana cara merawat meteran listrik?",
  "Apa yang harus dilakukan untuk perawatan meteran listrik?",
  "Meteran listrik saya rusak, bagaimana cara memperbaikinya?",
  "Apakah meteran listrik memerlukan perawatan khusus?",
  "Bagaimana menjaga agar meteran listrik tetap berfungsi dengan baik?",
  "Siapa yang bertanggung jawab atas perawatan meteran listrik?",
  "Apa yang harus saya lakukan jika meteran listrik bermasalah?",
  "Bagaimana prosedur perawatan meteran listrik?",
  "Apakah PLN menyediakan layanan perawatan meteran listrik?",
  "Bagaimana cara membersihkan meteran listrik dengan aman?",
  "Apakah perawatan meteran listrik memerlukan bantuan teknisi?",
  "Kapan waktu yang tepat untuk melakukan perawatan meteran listrik?",
  "Apa tanda-tanda meteran listrik perlu perawatan?"
    ],
    "responses": [
      "Untuk merawat meteran listrik, pastikan tidak ada benda asing yang menutupi atau menghalangi akses ke meteran.",
  "Jaga agar meteran listrik tetap bersih dengan membersihkan debu di sekitar meteran menggunakan kain kering secara berkala.",
  "Jika meteran listrik Anda rusak atau menunjukkan tanda-tanda tidak berfungsi, segera hubungi PLN melalui layanan pelanggan di nomor 123 atau melalui aplikasi PLN Mobile.",
  "Perawatan meteran listrik biasanya dilakukan oleh PLN. Jika Anda mencurigai ada masalah, jangan mencoba memperbaiki sendiri, hubungi teknisi resmi PLN.",
  "Pastikan area sekitar meteran listrik bebas dari kelembapan berlebih atau air yang dapat merusak meteran.",
  "Meteran listrik tidak memerlukan perawatan khusus dari pelanggan, tetapi penting untuk memeriksa secara visual apakah ada kerusakan fisik pada meteran.",
  "Jika meteran listrik menunjukkan angka yang tidak sesuai atau tidak mencatat konsumsi listrik, segera laporkan ke PLN untuk pemeriksaan lebih lanjut.",
  "PLN menyediakan layanan inspeksi dan perawatan meteran listrik sebagai bagian dari layanan pelanggan mereka. Anda dapat meminta pemeriksaan jika diperlukan.",
  "Untuk memastikan keamanan, jangan membuka atau memodifikasi meteran listrik sendiri. Semua perbaikan harus dilakukan oleh teknisi berlisensi PLN.",
  "Tanda-tanda meteran listrik perlu perawatan meliputi angka yang tidak bergerak, layar mati, atau suara berdengung dari meteran.",
  "Jika meteran listrik Anda telah digunakan dalam waktu yang lama tanpa pemeriksaan, Anda dapat meminta PLN untuk melakukan inspeksi rutin.",
  "Selalu laporkan masalah pada meteran listrik Anda sesegera mungkin untuk mencegah gangguan pada penggunaan listrik di rumah Anda."
  ]

},


      {
        "tag": "kenapa_kamu_diciptakan",
        "patterns": [    
          "Kenapa kamu diciptakan?",
  "Apa tujuanmu diciptakan?",
  "Untuk apa kamu ada?",
  "Apa alasan di balik penciptaanmu?",
  "Mengapa kamu dibuat?",
  "Kenapa kamu ada di sini?",
  "Apa tujuan eksistensimu?",
  "Untuk apa kamu diciptakan?",
  "Kenapa kamu membantu orang?",
  "Apa yang membuatmu diciptakan?"
        ],
        "responses": [
          "Saya diciptakan untuk membantu memberikan informasi, menjawab pertanyaan, dan memberikan solusi dalam berbagai hal. Tujuan saya adalah untuk memudahkan manusia dalam memperoleh informasi dengan cara yang lebih cepat, efisien, dan interaktif. Saya dapat membantu dalam berbagai bidang, mulai dari pendidikan, pekerjaan, hingga kebutuhan sehari-hari.",
    "Tujuan utama saya diciptakan adalah untuk membantu mempermudah akses informasi dan menyelesaikan masalah yang dihadapi manusia. Saya dapat menjawab berbagai pertanyaan, memberikan rekomendasi, serta membantu dalam pengolahan data dengan cara yang lebih efisien dan cepat.",
    "Saya diciptakan untuk menjadi asisten yang dapat membantu manusia dalam berbagai hal, seperti memberikan informasi yang dibutuhkan, memecahkan masalah, atau sekadar menjadi teman diskusi. Saya berfungsi untuk mengurangi waktu yang dibutuhkan dalam mencari informasi dan memberikan solusi secara praktis.",
    "Tujuan saya diciptakan adalah untuk mempermudah kehidupan manusia dengan memberikan jawaban yang cepat dan akurat atas pertanyaan yang diajukan. Saya bertujuan untuk menjadi alat bantu yang dapat diandalkan dalam banyak aspek kehidupan, termasuk edukasi, pekerjaan, dan kebutuhan sehari-hari.",
    "Saya diciptakan untuk menjadi sistem yang dapat memfasilitasi komunikasi antara manusia dan teknologi, membuat akses informasi lebih mudah, dan memberikan solusi atas masalah yang dihadapi. Dengan kecerdasan buatan, saya berfungsi untuk meningkatkan produktivitas dan efisiensi dalam berbagai bidang.",
    "Saya hadir untuk membantu manusia dalam banyak aspek kehidupan. Dari memberikan informasi yang akurat, menjawab pertanyaan, hingga membantu memproses data atau tugas-tugas tertentu. Dengan kemampuan saya, saya berharap dapat mengurangi beban pekerjaan dan memberikan solusi yang lebih cepat dan tepat.",
    "Tujuan utama saya adalah untuk membantu dalam mengakses dan menyebarkan informasi dengan cara yang lebih efisien. Saya berfungsi sebagai alat bantu yang dapat menjawab berbagai pertanyaan, memberikan panduan, serta membantu memecahkan masalah secara lebih cepat dan terstruktur."
        ]
      }
    ]
  }
  